//Fri Jul 05 2024 06:14:35 GMT+0000 (Coordinated Universal Time)
//Base:https://github.com/echo094/decode-js
//Modify:https://github.com/smallfawn/decode_action
const _0x558f42 = new _0x174eb4("追书神器");
let _0x24dbb3 = ["\n", "@"],
  _0x119ac9,
  _0x3c719b,
  _0x34adbb,
  _0x5461b7 = (_0x558f42.isNode() ? process.env.zssqCookie : _0x558f42.getdata("zssqCookie")) || "",
  _0x9d0e2a = [],
  _0x236070 = 0,
  _0x14715b = 0,
  _0x1e4b84 = 5,
  _0x36d8c0 = 1.02,
  _0x3550c7 = 0,
  _0x548e5e = "zssq",
  _0x5d915e = "https://leafxcy.coding.net/api/user/leafxcy/project/validcode/shared-depot/validCode/git/blob/master/code.json";
const _0x21f3e1 = {
  keys: "《庆余年》中范闲的父亲是谁？",
  answer: "庆帝"
};
const _0xdf7dda = {
  keys: "萨顶顶演唱歌曲《左手指月》是以下哪部影视剧的片尾曲？",
  answer: "香蜜沉沉烬如霜"
};
const _0x3bf2f9 = {
  keys: "古力娜扎在影视剧《择天记》中，饰演了哪一个角色？",
  answer: "徐有容"
};
const _0x291d16 = {
  keys: "鹿晗主演的玄幻影视剧《择天记》的原著作者是？",
  answer: "猫腻"
};
const _0x59c7ea = {
  keys: "作为书中的一个百年一遇的天才，你应该？",
  answer: "低调行事，避免成炮灰送命"
};
const _0x2ae68e = {
  keys: "网剧《我叫余欢水》改编自以下哪部小说？",
  answer: "如果没有明天"
};
const _0x1d72fc = {
  keys: "玄幻小说剧《斗罗大陆》中唐三与小舞初遇的地点是？",
  answer: "诺丁学院"
};
const _0x1a0896 = {
  keys: "影视剧《旋风少女》中饰演若白一角的演员是谁？",
  answer: "杨洋"
};
const _0x45e8fa = {
  keys: "《传闻中的陈芊芊》中陈芊芊的青梅竹马是",
  answer: "裴恒"
};
const _0x271ab2 = {
  keys: "电影《晴雅集》改编自日本哪位作家的同名作品？",
  answer: "梦枕貘"
};
const _0x1d550b = {
  keys: "《我有一座冒险屋》中主角常用的武器是什么？",
  answer: "大锤"
};
const _0x1467d1 = {
  keys: "小说《全职高手》的作者是？",
  answer: "蝴蝶蓝"
};
const _0x5b5f30 = {
  keys: "“第四天灾流”小说中的第四天灾指的是？",
  answer: "玩家"
};
const _0x228c9c = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x3703d3 = {
  keys: "以下哪位作家不是悬疑小说作家？",
  answer: "江南"
};
const _0x2e69de = {
  keys: "《大主宰》《斗破苍穹》等作品的作者笔名“天蚕土豆”出自其家乡小吃：",
  answer: "狼牙土豆"
};
const _0x290454 = {
  keys: "唐家三少的《生肖守护神》哪个属相是“老大”？",
  answer: "麒麟"
};
const _0x483e0f = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x321579 = {
  keys: "《斗破苍穹》纳兰嫣然为什么会和主角萧炎悔婚？",
  answer: "没有实力"
};
const _0x2b0fe9 = {
  keys: "下列哪本小说的爱情故事没有经历多个轮回？",
  answer: "三生门"
};
const _0x1e1f51 = {
  keys: "《武道宗师》因为其中爱情情节的描写，又被称为《__宗师》？",
  answer: "狗粮"
};
const _0x16fd82 = {
  keys: "《修真聊天群》主角霸刀宋壹因为恐高，无法御刀而行，所以打算给自己的刀装上什么？",
  answer: "护栏"
};
const _0x4e9345 = {
  keys: "主角穿越之后在天上飘了十几万年才下来的小说，是以下哪一本？",
  answer: "黎明之剑"
};
const _0x121863 = {
  keys: "以下哪个人物不是出自作家天下霸唱的作品？",
  answer: "王建国"
};
const _0x3c6349 = {
  keys: "《超神宠兽店》是近期值得一看的战宠文，这本书的作者还创作了知名黑暗文《黑暗王者》，请问作者是？",
  answer: "古羲"
};
const _0x58259a = {
  keys: "在网剧《狐狸的夏天》中谭松韵饰演了哪一个角色？",
  answer: "黎晏书"
};
const _0x5d53c9 = {
  keys: "男频中出现男主不带感情的推倒很多妹子的情节一般出现在什么类型的小说中？",
  answer: "种马文"
};
const _0x5954f9 = {
  keys: "《隐秘的角落》原著小说叫什么名字",
  answer: "坏小孩"
};
const _0x2b0cfb = {
  keys: "“白前辈保佑”出自于哪本小说？",
  answer: "《修真聊天群》"
};
const _0x5365d4 = {
  keys: "《一起来看流星雨》中饰演“慕容云海”一角的演员是？",
  answer: "张翰"
};
const _0x18abd1 = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x2bee1e = {
  keys: "穿到皇宫，你可以在皇后和贵妃之间选择一个身份，你应该",
  answer: "选贵妃，从宫斗剧看贵妃一定更受宠"
};
const _0x4b2025 = {
  keys: "电影《晴雅集》中饰演饰演“公主”的演员是？",
  answer: "王子文"
};
const _0x4fd5cd = {
  keys: "哪本书的主角是诸天万族的劫？",
  answer: "万族之劫"
};
const _0x572fb0 = {
  keys: "《鬼吹灯》的作者是谁",
  answer: "天下霸唱"
};
const _0x382f39 = {
  keys: "网剧《我就是这般女子》女主角是谁饰演的？",
  answer: "关晓彤"
};
const _0x4187f1 = {
  keys: "马伯庸说《长安十二时辰》的脑洞原型来自什么",
  answer: "刺客信条"
};
const _0x553bc1 = {
  keys: "下列作品中，不是现实题材的是？",
  answer: "《最强狂兵》"
};
const _0x65060b = {
  keys: "以下影视剧中哪部不属于由作家桐华的作品改编？",
  answer: "东宫"
};
const _0x57a8f5 = {
  keys: "电影《少年的你》改编自以下哪位作者的小说作品？",
  answer: "玖月晞"
};
const _0x4ad0cd = {
  keys: "以下哪本是古穿今？",
  answer: "《新唐遗玉》"
};
const _0x1a465e = {
  keys: "《全球高武》主人公方平是哪国人？",
  answer: "华国"
};
const _0xd7bd1a = {
  keys: "《狂神》的作者是谁？",
  answer: "唐家三少"
};
const _0x4a14ad = {
  keys: "以下哪些演员没有饰演过张起灵？",
  answer: "吴磊"
};
const _0x4f0233 = {
  keys: "开启总裁文一脉的是以下哪本书？",
  answer: "《泡沫之夏》"
};
const _0x520ec9 = {
  keys: "《史上第一混乱》是反穿越的代表作之一，这本小说是哪里的人物穿越到现代发生的爆笑故事？",
  answer: "古代"
};
const _0x1d7b5c = {
  keys: "仙侠小说《大奉打更人》中，作者加入了悬疑探案类元素，十分吸引人。请问主角开场遇到的第一个案件是？",
  answer: "税银丢失案"
};
const _0x3ec8f0 = {
  keys: "《都市极品医神》的主角叫什么？",
  answer: "叶辰"
};
const _0x45ed32 = {
  keys: "《遮天》中狠人大帝“不为成仙，只为红尘中等你归来。”，等待的是谁？",
  answer: "哥哥"
};
const _0x280be9 = {
  keys: "《从零开始》更新了数年，近两千万字，才终于完结。请问从零开始更新了几年？",
  answer: "11年"
};
const _0x50f371 = {
  keys: "《悟空传》的作者叫什么",
  answer: "今何在"
};
const _0x2d6fc2 = {
  keys: "以下不是南派三叔的作品的是？",
  answer: "《庆余年》"
};
const _0x43db7a = {
  keys: "由张杰演唱歌曲《剑心》是以下哪部电视剧的主题曲？",
  answer: "古剑奇谭"
};
const _0x48abeb = {
  keys: "《美食供应商》中男主拥有什么系统？",
  answer: "厨神系统"
};
const _0x18ea4f = {
  keys: "以下哪位明星没有饰演过“夜华”这一角色？",
  answer: "王一博"
};
const _0x1a1ddf = {
  keys: "“我只想当个酒馆老板，李世民却总跑来问我什么治国良策，什么？还要请我出山治国？”这本小说是？",
  answer: "大唐国士无双"
};
const _0x5730e0 = {
  keys: "穿越成哈士奇的秦小白看着眼前要给它洗澡的美女主播主人，陷入了沉思。请问这本小说是？",
  answer: "《直播：女神家的哈士奇天秀》"
};
const _0x47b718 = {
  keys: "主角穿越之后在天上飘了十几万年才下来的小说，是以下哪一本？",
  answer: "黎明之剑"
};
const _0x2c90b6 = {
  keys: "《史上最强炼气期》的主角叫？",
  answer: "方羽"
};
const _0x56f6d3 = {
  keys: "下列哪个小说的主角不是身体残障人士？",
  answer: "唐三"
};
const _0x47b07d = {
  keys: "请问钮钴禄甄嬛和魏璎珞是什么关系？",
  answer: "婆媳"
};
const _0x1b3005 = {
  keys: "被誉为悬疑言情小说天后的作者是？",
  answer: "丁墨"
};
const _0x2b56a0 = {
  keys: "一个靠着垂钓系统把自己钓出了“科技巨头”并拯救地球的小说是以下哪本？",
  answer: "《玩坏世界的垂钓者》"
};
const _0x3e7346 = {
  keys: "天蚕土豆的哪本小说男主从小就对女主进行“马杀鸡”？",
  answer: "《斗破苍穹》"
};
const _0x10ab8d = {
  keys: "小说中《斗罗大陆》中史莱克学院的口号是什么？",
  answer: "只收怪物"
};
const _0xb34ccc = {
  keys: "袁冰妍在影视剧《听雪楼》中，饰演了哪一个角色？",
  answer: "舒靖容"
};
const _0x45c5ec = {
  keys: "电影《晴雅集》中饰演博雅一角的演员是？",
  answer: "邓伦"
};
const _0x45fe24 = {
  keys: "《龙族》的主角是谁？",
  answer: "路明非"
};
const _0x241bc2 = {
  keys: "请问女主女扮男装，男主怎么才可以知道她是个女孩子？",
  answer: "摸胸"
};
const _0x363465 = {
  keys: "网剧《三千鸦杀》中男主傅九云的真实身份是？",
  answer: "灵灯灯芯"
};
const _0x4a36de = {
  keys: "《轮回乐园》作为一本长期霸榜的漫综无限流作品，即将突破1000万字。请问这本小说的作者是？",
  answer: "那一只蚊子"
};
const _0x200c20 = {
  keys: "《我师兄实在太稳健了》主角半夜爬进师妹房间，为了——？",
  answer: "补习"
};
const _0x45c0f8 = {
  keys: "电视就《狼殿下》中肖战饰演了哪一个角色？",
  answer: "疾冲"
};
const _0x549537 = {
  keys: "作者\"我吃西红柿”的作品《盘龙》中的盘龙指的是？",
  answer: "戒指"
};
const _0x39ec08 = {
  keys: "以下哪本书是宅猪的作品",
  answer: "帝尊"
};
const _0xb92c80 = {
  keys: "以下哪种小说题材还没有拍过？",
  answer: "种田"
};
const _0x5502ef = {
  keys: "《传闻中的陈芊芊》中陈芊芊是几公主",
  answer: "三公主"
};
const _0x3a0191 = {
  keys: "“整容式演技”最初是用于形容以下哪位演员的演技？",
  answer: "赵又廷"
};
const _0x3240d1 = {
  keys: "网文改编剧《华胥引》的原著作者是？",
  answer: "唐七"
};
const _0x3e32a4 = {
  keys: "电视剧《三生三世十里桃花》里，白浅的武器是？",
  answer: "玉清昆仑扇"
};
const _0x2fdd08 = {
  keys: "《土豪系统在都市》中杨昊带小丫王者开黑时用的什么英雄？",
  answer: "亚瑟"
};
const _0x32722b = {
  keys: "《修真聊天群》主角霸刀宋壹因为恐高，无法御刀而行，所以打算给自己的刀装上什么？",
  answer: "护栏"
};
const _0x58a1f2 = {
  keys: "请问钮钴禄甄嬛和魏璎珞是什么关系？",
  answer: "婆媳"
};
const _0x56fc62 = {
  keys: "主角靠演技去扮演大佬获取资源提升自己，是以下哪本书的套路？",
  answer: "《我是演员》"
};
const _0x140853 = {
  keys: "《斗破苍穹》纳兰嫣然为什么会和主角萧炎悔婚？",
  answer: "没有实力"
};
const _0x455eed = {
  keys: "电视剧《甄嬛传》的原著小说作者是？",
  answer: "流潋紫"
};
const _0x24cfea = {
  keys: "以下哪部影视剧不属于由作家猫腻的小说作品改编？",
  answer: "《香蜜沉沉烬如霜》"
};
const _0x1359a8 = {
  keys: "影视剧《都挺好》中女主的“作爹”叫什么名字",
  answer: "苏大强"
};
const _0x22dcde = {
  keys: "以下影视中哪部不属于由顾漫作品改编？",
  answer: "冰糖炖雪梨"
};
const _0x376ab2 = {
  keys: "杨幂在影视剧《美人心计》中饰演了哪个角色？",
  answer: "莫雪鸢"
};
const _0x540f4e = {
  keys: "你穿成了一个正在和亲路上的公主，你应该？",
  answer: "高度警惕，等待刺杀劫亲剧情"
};
const _0x77a76b = {
  keys: "《三体》中将人类二维化的宇宙飞船叫什么？",
  answer: "二向箔"
};
const _0xfdb1b3 = {
  keys: "你突然穿回了90年代，你应该？",
  answer: "煽动全家买股票，全仓白酒"
};
const _0x4489a0 = {
  keys: "成毅在网剧《琉璃》中饰演的角色是？",
  answer: "禹司凤"
};
const _0x5da9e8 = {
  keys: "作为书中的一个百年一遇的天才，你应该？",
  answer: "低调行事，避免成炮灰送命"
};
const _0x7191bb = {
  keys: "《武道宗师》因为其中爱情情节的描写，又被称为《__宗师》？",
  answer: "狗粮"
};
const _0x2d8b92 = {
  keys: "以下哪本小说的故事没有发生在架空世界？",
  answer: "活着"
};
const _0x194938 = {
  keys: "主角靠演技去扮演大佬获取资源提升自己，是以下哪本书的套路？",
  answer: "《我是演员》"
};
const _0x53e254 = {
  keys: "《史上最强炼气期》主角五千年一直停留在炼气期无法筑基，寿命却几乎无限。请问主角的炼气期大概修炼到了多少层？",
  answer: "练气八千层"
};
const _0x37b172 = {
  keys: "《大主宰》《斗破苍穹》等作品的作者笔名“天蚕土豆”出自其家乡小吃：",
  answer: "狼牙土豆"
};
const _0x10e50d = {
  keys: "异能者不是人类而是一群猫，这样的世界是以下哪本小说？",
  answer: "《难道是我是神》"
};
const _0x50d3ab = {
  keys: "小说《全职高手》的作者是？",
  answer: "蝴蝶蓝"
};
const _0x6486e8 = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x5801fb = {
  keys: "《全职法师》中的主角莫凡是什么职业？",
  answer: "魔法师"
};
const _0x2f5964 = {
  keys: "《仙逆》主角修炼最大的特色是：",
  answer: "化凡"
};
const _0x5cd2fe = {
  keys: "小说中《斗罗大陆》中史莱克学院的口号是什么？",
  answer: "只收怪物"
};
const _0x37e514 = {
  keys: "以下哪本小说中的女主角唱歌很好听？",
  answer: "很想很想你"
};
const _0x2d80d7 = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x104bec = {
  keys: "小说《诛仙》里主角身边的动物是什么？",
  answer: "猴"
};
const _0xe60ffa = {
  keys: "《星戒》小说中炎日刀君的弟弟叫什么名字？",
  answer: "苍月刀君"
};
const _0x139e27 = {
  keys: "突然穿回到小学，你应该？",
  answer: "一年跳5级，顺带发家致富招小弟"
};
const _0x5baef4 = {
  keys: "你穿越的到古代皇宫成了一名妃子，你应该？",
  answer: "花式宫斗，争取做到皇太后"
};
const _0x41d517 = {
  keys: "你穿成了一个正在和亲路上的公主，你应该？",
  answer: "高度警惕，等待刺杀劫亲剧情"
};
const _0x560187 = {
  keys: "在总裁文中，进错包厢被当成酒托，你应该？",
  answer: "将错就错，成功吸引霸总男主注意"
};
const _0x4b5c58 = {
  keys: "《三体》中将人类二维化的宇宙飞船叫什么？",
  answer: "二向箔"
};
const _0x1a5929 = {
  keys: "小说《赘婿》改编的电视剧男主角是？",
  answer: "郭麒麟"
};
const _0x4596d9 = {
  keys: "《仙逆》主角修炼最大的特色是：",
  answer: "化凡"
};
const _0x4290bd = {
  keys: "以下哪个说法指的是“系统流”小说？",
  answer: "描述主角有个系统，并且帮助自己升级的小说。"
};
const _0x3188d2 = {
  keys: "以下哪部电影不是由小说改编而成？",
  answer: "滚蛋吧肿瘤君"
};
const _0x1bfc5e = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x18b501 = {
  keys: "“天不生我李淳罡，剑道万古长如夜”这句话出自哪本书？",
  answer: "雪中悍刀行"
};
const _0x425acb = {
  keys: "《帝霸》主角为了找丢失的__误入疯魔洞？",
  answer: "羊"
};
const _0x55d546 = {
  keys: "小说《赘婿》改编的电视剧男主角是？",
  answer: "郭麒麟"
};
const _0x36dbfe = {
  keys: "下列哪个小说的主角不是身体残障人士？",
  answer: "唐三"
};
const _0x174a58 = {
  keys: "以下哪个说法指的是“系统流”小说？",
  answer: "描述主角有个系统，并且帮助自己升级的小说。"
};
const _0x1b4621 = {
  keys: "你穿成了一个正在和亲路上的公主，你应该？",
  answer: "高度警惕，等待刺杀劫亲剧情"
};
const _0x357aa0 = {
  keys: "《三体》中将人类二维化的宇宙飞船叫什么？",
  answer: "二向箔"
};
const _0x3420da = {
  keys: "你突然穿回了90年代，你应该？",
  answer: "煽动全家买股票，全仓白酒"
};
const _0x3e7020 = {
  keys: "成毅在网剧《琉璃》中饰演的角色是？",
  answer: "禹司凤"
};
const _0x179c51 = {
  keys: "作为书中的一个百年一遇的天才，你应该？",
  answer: "低调行事，避免成炮灰送命"
};
const _0x24839c = {
  keys: "穿到皇宫，你可以在皇后和贵妃之间选择一个身份，你应该",
  answer: "选贵妃，从宫斗剧看贵妃一定更受宠"
};
const _0x49d2b3 = {
  keys: "在晋江纯爱文中，男主一般会有几位夫人？",
  answer: "男主没有夫人，只有男人"
};
const _0x13e399 = {
  keys: "《庆余年》中范闲的父亲是谁？",
  answer: "庆帝"
};
const _0x822223 = {
  keys: "萨顶顶演唱歌曲《左手指月》是以下哪部影视剧的片尾曲？",
  answer: "香蜜沉沉烬如霜"
};
const _0x5af78b = {
  keys: "古力娜扎在影视剧《择天记》中，饰演了哪一个角色？",
  answer: "徐有容"
};
const _0x3b276d = {
  keys: "以下哪个人物是《斗罗大陆》中的女主角？",
  answer: "小舞"
};
const _0x5253ed = {
  keys: "与《斗破苍穹》内容无关的小说是",
  answer: "庆余年"
};
const _0x54bf58 = {
  keys: "《斗破苍穹》电视剧萧炎是谁扮演的？",
  answer: "吴磊"
};
const _0x10743e = {
  keys: "《风声》的作者是谁？",
  answer: "麦家"
};
const _0xcacda = {
  keys: "《隐秘的角落》原著是谁的小说？",
  answer: "紫金陈"
};
const _0x4136f9 = {
  keys: "《沙海》与《盗墓笔记》的关系是",
  answer: "后传"
};
const _0x51431e = {
  keys: "《灵域》女主角凌语诗电视剧扮演者是谁？",
  answer: "程潇"
};
const _0x1871bf = {
  keys: "以下哪本是古穿今？",
  answer: "《新唐遗玉》"
};
const _0x5aa0a0 = {
  keys: "《全球高武》主人公方平是哪国人？",
  answer: "华国"
};
const _0x51de66 = {
  keys: "《狂神》的作者是谁？",
  answer: "唐家三少"
};
const _0x36c7c6 = {
  keys: "《吞噬星空》的故事，发生在什么年代？",
  answer: "未来"
};
const _0x139266 = {
  keys: "请问古代太医一把脉说的一句话是什么？",
  answer: "有喜了"
};
const _0x4cbd96 = {
  keys: "章子怡在影视剧《上阳赋》中饰演了哪一个角色？",
  answer: "王儇"
};
const _0x126c45 = {
  keys: "《长安十二时辰》中易烊千玺扮演的角色叫什么",
  answer: "李必"
};
const _0x301694 = {
  keys: "《星辰变》的主角秦羽，有两个妖兽兄弟。是什么动物？",
  answer: "鹰和猿"
};
const _0x1be2aa = {
  keys: "影视剧《都挺好》中女主的“作爹”叫什么名字",
  answer: "苏大强"
};
const _0x42d28b = {
  keys: "“整容式演技”最初是用于形容以下哪位演员的演技？",
  answer: "赵又廷"
};
const _0x3059e4 = {
  keys: "电视剧《三生三世十里桃花》里，杨幂一人分饰几角？",
  answer: "4"
};
const _0x23b7e5 = {
  keys: "网文改编剧《华胥引》的原著作者是？",
  answer: "唐七"
};
const _0x4ee767 = {
  keys: "电视剧《甄嬛传》的原著小说作者是？",
  answer: "流潋紫"
};
const _0x308613 = {
  keys: "“遭遇突变、伤心难过时冲到外面，一定是打雷下暴雨”这类情节称之为___?",
  answer: "撒狗血"
};
const _0x5d0f1e = {
  keys: "《恶魔法则》的男主角叫什么",
  answer: "杜维"
};
const _0x5b16c9 = {
  keys: "网剧《我就是这般的女子》改编自以下哪部小说？",
  answer: "我就是这般的女子"
};
const _0x2eac22 = {
  keys: "《灵域》作者是谁？",
  answer: "逆苍天"
};
const _0x348c33 = {
  keys: "猜书名：“震惊！一男子男女通吃，一人妖为爱变性”",
  answer: "《修真聊天群》"
};
const _0x58c13f = {
  keys: "电视剧《三生三世十里桃花》里，杨幂一人分饰几角？",
  answer: "4"
};
const _0x458572 = {
  keys: "网文改编剧《华胥引》的原著作者是？",
  answer: "唐七"
};
const _0x33695e = {
  keys: "电视剧《甄嬛传》的原著小说作者是？",
  answer: "流潋紫"
};
const _0x323a0d = {
  keys: "以下哪部影视剧不属于由作家猫腻的小说作品改编？",
  answer: "《香蜜沉沉烬如霜》"
};
const _0x3a8899 = {
  keys: "《盗墓笔记》的张起灵的别称叫什么",
  answer: "闷油瓶"
};
const _0xea1f5b = {
  keys: "《何以笙箫默》中男女主角分别是什么职业？",
  answer: "律师与摄影师"
};
const _0x1fb55a = {
  keys: "网剧《我就是这般的女子》改编自以下哪部小说？",
  answer: "我就是这般的女子"
};
const _0x3ec75e = {
  keys: "《遮天》中，我儿王腾，有____?",
  answer: "大帝之姿"
};
const _0x31cd6d = {
  keys: "《圣墟》中，神秘老人所认定的“地球真子”的名字叫什么？",
  answer: "周尚"
};
const _0x45078e = {
  keys: "猜书名：“震惊！一男子男女通吃，一人妖为爱变性”",
  answer: "《修真聊天群》"
};
const _0x4f8bbf = {
  keys: "在2016年出品的影视剧《我的前半生》中，袁泉饰演了哪一个角色？",
  answer: "唐晶"
};
const _0x44ff27 = {
  keys: "穿越到异世界首先应该干什么？",
  answer: "赶紧检查下有没有系统"
};
const _0x46424d = {
  keys: "《隐秘的角落》原著是谁的小说？",
  answer: "紫金陈"
};
const _0x3053d1 = {
  keys: "影视剧《香蜜沉沉烬如霜》的原著小说作者是？",
  answer: "电线"
};
const _0x1fba5a = {
  keys: "与《斗破苍穹》内容无关的小说是",
  answer: "庆余年"
};
const _0x23e9e4 = {
  keys: "请问小燕子和魏璎珞儿子的妻子之间是什么关系？",
  answer: "妯娌"
};
const _0x26eaf2 = {
  keys: "哪部不是囧囧有妖的作品？",
  answer: "《微微一笑很倾城》"
};
const _0x4e0986 = {
  keys: "猜书名：“可怕！一男子居然和锅生了条鱼”",
  answer: "《异常生物见闻录》"
};
const _0x1c4a5f = {
  keys: "《冒牌大英雄》的作者是？",
  answer: "七十二编"
};
const _0x46c75d = {
  keys: "修真小说中以下哪个境界最高？",
  answer: "元婴期"
};
const _0x562911 = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x3403c1 = {
  keys: "请问钮钴禄甄嬛和魏璎珞是什么关系？",
  answer: "婆媳"
};
const _0x5b53ca = {
  keys: "被誉为悬疑言情小说天后的作者是？",
  answer: "丁墨"
};
const _0x56acc0 = {
  keys: "一个靠着垂钓系统把自己钓出了“科技巨头”并拯救地球的小说是以下哪本？",
  answer: "《玩坏世界的垂钓者》"
};
const _0x13ee06 = {
  keys: "天蚕土豆的哪本小说男主从小就对女主进行“马杀鸡”？",
  answer: "《斗破苍穹》"
};
const _0x44a4d0 = {
  keys: "猜书名：“可怕！一男子居然和锅生了条鱼”",
  answer: "《异常生物见闻录》"
};
const _0x57f9d3 = {
  keys: "《全球高武》主人公方平是哪国人？",
  answer: "华国"
};
const _0x31718d = {
  keys: "以下哪位明星没有饰演过“夜华”这一角色？",
  answer: "王一博"
};
const _0xaff70e = {
  keys: "《终极笔记》中谁扮演吴邪？",
  answer: "曾舜晞"
};
const _0xda68f2 = {
  keys: "《长安十二时辰》中易烊千玺扮演的角色叫什么",
  answer: "李必"
};
const _0x2404d3 = {
  keys: "《凤囚凰》中容止将司马相如写给卓文君的情诗念给谁听？",
  answer: "楚玉"
};
const _0x38122c = {
  keys: "《没钱上大学的我只能去屠龙了》被许多读者称为近似《xx》原著的同人文!请问xx是哪部作品",
  answer: "龙族"
};
const _0x45df43 = {
  keys: "以下哪位作者是女性？",
  answer: "陈词懒调"
};
const _0x248487 = {
  keys: "《无限恐怖》中，主角郑吒经历的第一个恐怖世界是？",
  answer: "生化危机"
};
const _0x3d1bc5 = {
  keys: "《凡人修仙传》主角韩立的绰号是？",
  answer: "韩跑跑"
};
const _0x51f2ee = {
  keys: "玄幻小说《斗罗大陆》中女主角小舞的第一魂技是？",
  answer: "腰弓"
};
const _0x1c0833 = {
  keys: "你在路边捡到一个古早游戏光盘，你应该？",
  answer: "找个光驱启动游戏，准备迎接系统绑定"
};
const _0x5dc756 = {
  keys: "网剧《琉璃》的原著小说是？",
  answer: "琉璃美人煞"
};
const _0xda2159 = {
  keys: "《雪中悍刀行》中徐凤年的扮演者是谁？",
  answer: "张若昀"
};
const _0x10469c = {
  keys: "《鬼吹灯》的作者是谁",
  answer: "天下霸唱"
};
const _0x49cc63 = {
  keys: "电影《少年的你》改编自以下哪位作者的小说作品？",
  answer: "玖月晞"
};
const _0x2c374a = {
  keys: "以下哪本书的外挂，不是“老爷爷”的。",
  answer: "我真不是大明星"
};
const _0x5e7352 = {
  keys: "《吞噬星空》的作者是谁？",
  answer: "我吃西红柿"
};
const _0x1ee479 = {
  keys: "影视剧《上阳赋》的原著小说叫什么？",
  answer: "帝王业"
};
const _0x78eb9a = {
  keys: "废土流小说属于？",
  answer: "求生小说"
};
const _0x5d6c41 = {
  keys: "《圣墟》的主角叫什么？",
  answer: "楚风"
};
const _0x514423 = {
  keys: "《斗罗大陆》唐三的封号是什么？",
  answer: "千手斗罗"
};
const _0x42a438 = {
  keys: "异能者不是人类而是一群猫，这样的世界是以下哪本小说？",
  answer: "《难道是我是神》"
};
const _0x164a94 = {
  keys: "小说《全职高手》的作者是？",
  answer: "蝴蝶蓝"
};
const _0x4911f2 = {
  keys: "《吞噬星空》主角罗峰成为宇宙之主后，自称__？",
  answer: "银河领主"
};
const _0x1eab1f = {
  keys: "《春风十里，不如你》改编自冯唐的什么小说？",
  answer: "北京北京"
};
const _0x12f00a = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x1741bc = {
  keys: "穿到皇宫，你可以在皇后和贵妃之间选择一个身份，你应该",
  answer: "选贵妃，从宫斗剧看贵妃一定更受宠"
};
const _0x28af93 = {
  keys: "电影《晴雅集》中饰演饰演“公主”的演员是？",
  answer: "王子文"
};
const _0x2fe019 = {
  keys: "哪本书的主角是诸天万族的劫？",
  answer: "万族之劫"
};
const _0x5a32ad = {
  keys: "电视就《狼殿下》中肖战饰演了哪一个角色？",
  answer: "疾冲"
};
const _0x5eb801 = {
  keys: "作者\"我吃西红柿”的作品《盘龙》中的盘龙指的是？",
  answer: "戒指"
};
const _0x301dde = {
  keys: "以下哪本书是宅猪的作品",
  answer: "帝尊"
};
const _0x141345 = {
  keys: "开启洪荒流的是哪位作者的哪本书？",
  answer: "梦入神机《佛本是道》"
};
const _0xf8dec7 = {
  keys: "以下哪个人物不是出自作家天下霸唱的作品？",
  answer: "王建国"
};
const _0x53e544 = {
  keys: "电视剧《斗罗大陆》中饰演女主角小舞的明星是？",
  answer: "吴宣仪"
};
const _0x4d8a24 = {
  keys: "《斗罗大陆》中为爱献祭的十万年魂兽是？",
  answer: "小舞"
};
const _0x5f5349 = {
  keys: "《斗破苍穹》中萧炎在大千世界创建势力叫什么",
  answer: "无尽火域"
};
const _0x1fa30e = {
  keys: "《春风十里，不如你》改编自冯唐的什么小说？",
  answer: "北京北京"
};
const _0x45a704 = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x46820b = {
  keys: "《全球高武》主人公方平是哪界人？",
  answer: "人界"
};
const _0x5cb72e = {
  keys: "《吞噬星空》的作者是谁？",
  answer: "我吃西红柿"
};
const _0x4b4830 = {
  keys: "《斗破苍穹》电视剧萧炎是谁扮演的？",
  answer: "吴磊"
};
const _0x2c276c = {
  keys: "《恶魔法则》的男主角叫什么",
  answer: "杜维"
};
const _0x3b70cd = {
  keys: "郭敬明小说《悲伤逆流成河》于哪一年出版？",
  answer: "2007年"
};
const _0x4fb4e2 = {
  keys: "影视剧《知否知否应是绿肥红瘦》故事发生的背景朝代是？",
  answer: "北宋"
};
const _0x567574 = {
  keys: "《星辰变》的主角秦羽，有两个妖兽兄弟。是什么动物？",
  answer: "鹰和猿"
};
const _0x28a4e3 = {
  keys: "《龙族》中路明非与路鸣泽是？",
  answer: "兄弟"
};
const _0x312c7a = {
  keys: "赵丽颖在影视剧《知否知否应是绿肥红瘦》中饰演了哪一个角色？",
  answer: "盛明兰"
};
const _0x757ea4 = {
  keys: "《全球高武》的作者是谁？",
  answer: "老鹰吃小鸡"
};
const _0x5d8f58 = {
  keys: "《美食供应商》中男主拥有什么系统？",
  answer: "厨神系统"
};
const _0x32ba75 = {
  keys: "以下哪位明星没有饰演过“夜华”这一角色？",
  answer: "王一博"
};
const _0x19a632 = {
  keys: "《无限恐怖》中，罗甘道是被什么杀死的？",
  answer: "航空母舰"
};
const _0x3d2814 = {
  keys: "《何以笙箫默》中男女主角分别是什么职业？",
  answer: "律师与摄影师"
};
const _0x573644 = {
  keys: "《灵域》作者是谁？",
  answer: "逆苍天"
};
const _0x3f2260 = {
  keys: "主角拥有绝世美颜、超凡气质，举手投足可引天地异象，简直主角模板，偏偏他的修炼天赋平平无奇。这本小说是",
  answer: "《平平无奇大师兄》"
};
const _0x35f7a5 = {
  keys: "《史上最强炼气期》主角五千年一直停留在炼气期无法筑基，寿命却几乎无限。请问主角的炼气期大概修炼到了多少层？",
  answer: "练气八千层"
};
const _0x3edb93 = {
  keys: "小说《三体》中罗辑提出的理论是？",
  answer: "黑暗森林理论"
};
const _0x37fe30 = {
  keys: "下列哪位男主角不是网游高手？",
  answer: "范闲"
};
const _0x58cd79 = {
  keys: "修真小说中以下哪个境界最高？",
  answer: "元婴期"
};
const _0x360e46 = {
  keys: "《史上第一混乱》是反穿越的代表作之一，这本小说是哪里的人物穿越到现代发生的爆笑故事？",
  answer: "古代"
};
const _0x589d52 = {
  keys: "仙侠小说《大奉打更人》中，作者加入了悬疑探案类元素，十分吸引人。请问主角开场遇到的第一个案件是？",
  answer: "税银丢失案"
};
const _0x2a4d6b = {
  keys: "《都市极品医神》的主角叫什么？",
  answer: "叶辰"
};
const _0x3a645b = {
  keys: "《遮天》中狠人大帝“不为成仙，只为红尘中等你归来。”，等待的是谁？",
  answer: "哥哥"
};
const _0x21e3f7 = {
  keys: "《从零开始》更新了数年，近两千万字，才终于完结。请问从零开始更新了几年？",
  answer: "11年"
};
const _0x5a7412 = {
  keys: "小说中《鬼吹灯》摸金校尉祖师爷是谁？",
  answer: "曹操"
};
const _0x22e22e = {
  keys: "异能者不是人类而是一群猫，这样的世界是以下哪本小说？",
  answer: "《难道是我是神》"
};
const _0x4adc0d = {
  keys: "修真小说中的“神识”以下哪个解释是对的？",
  answer: "精神方面的力量"
};
const _0x55dbea = {
  keys: "“恐怖如斯”出自以下哪本书籍？",
  answer: "斗破苍穹"
};
const _0x32c19d = {
  keys: "以下哪本男频小说是女作者完成？",
  answer: "《回到过去变成猫》陈词懒调"
};
const _0x124d33 = {
  keys: "请问女主女扮男装，男主怎么才可以知道她是个女孩子？",
  answer: "摸胸"
};
const _0x5b52ba = {
  keys: "影视剧《美人心计》中饰演窦漪房（杜云汐）的演员是？",
  answer: "林心如"
};
const _0x5194b7 = {
  keys: "在晋江纯爱文中，男主一般会有几位夫人？",
  answer: "男主没有夫人，只有男人"
};
const _0x41e7a0 = {
  keys: "由刘诗诗、倪妮主演的影视剧《流金岁月》改编自以下哪位作家的作品？",
  answer: "亦舒"
};
const _0x419911 = {
  keys: "下列影视剧中，哪部是改编自网络小说？",
  answer: "极品家丁"
};
const _0x24450c = {
  keys: "开启总裁文一脉的是以下哪本书？",
  answer: "《泡沫之夏》"
};
const _0x1f6839 = {
  keys: "《我有一座冒险屋》中主角常用的武器是什么？",
  answer: "大锤"
};
const _0x3b646b = {
  keys: "下面三部作品，属于都市灵气复苏类爽文的神作是？",
  answer: "全球高武"
};
const _0x147029 = {
  keys: "《灵域》作者是谁？",
  answer: "逆苍天"
};
const _0x108c6f = {
  keys: "《没钱上大学的我只能去屠龙了》被许多读者称为近似《xx》原著的同人文!请问xx是哪部作品",
  answer: "龙族"
};
const _0x2e7b96 = {
  keys: "以下哪本男频小说是女作者完成？",
  answer: "《回到过去变成猫》陈词懒调"
};
const _0x5a8091 = {
  keys: "《凤囚凰》中容止将司马相如写给卓文君的情诗念给谁听？",
  answer: "楚玉"
};
const _0x52c385 = {
  keys: "修真小说中的“神识”以下哪个解释是对的？",
  answer: "精神方面的力量"
};
const _0x353b16 = {
  keys: "“我儿王腾有大帝之资”这个梗出自哪本小说？",
  answer: "《遮天》"
};
const _0x247bab = {
  keys: "以下哪本网络小说2020年带火了一个流派？",
  answer: "诡秘之主"
};
const _0x105a94 = {
  keys: "下列作品中，不是现实题材的是？",
  answer: "《最强狂兵》"
};
const _0xc6581c = {
  keys: "《沙海》与《盗墓笔记》的关系是",
  answer: "后传"
};
const _0x46f67f = {
  keys: "马伯庸说《长安十二时辰》的脑洞原型来自什么",
  answer: "刺客信条"
};
const _0x4af51e = {
  keys: "以下不是南派三叔的作品的是？",
  answer: "《庆余年》"
};
const _0x542bf4 = {
  keys: "在2016年出品的影视剧《我的前半生》中，袁泉饰演了哪一个角色？",
  answer: "唐晶"
};
const _0x51836b = {
  keys: "一个靠着垂钓系统把自己钓出了“科技巨头”并拯救地球的小说是以下哪本？",
  answer: "《玩坏世界的垂钓者》"
};
const _0x2ffd28 = {
  keys: "唐家三少的《生肖守护神》哪个属相是“老大”？",
  answer: "麒麟"
};
const _0x272905 = {
  keys: "《重生之将门毒后》一书中男主最喜欢怎么称呼女主？",
  answer: "沈娇娇"
};
const _0x3d5399 = {
  keys: "“老子的心情比烟花还要寂寞”出现在了猫腻的哪本小说中？",
  answer: "《间客》"
};
const _0x2ab640 = {
  keys: "《史上最强炼气期》主角五千年一直停留在炼气期无法筑基，寿命却几乎无限。请问主角的炼气期大概修炼到了多少层？",
  answer: "练气八千层"
};
const _0x2486a1 = {
  keys: "《修真聊天群》主角霸刀宋壹因为恐高，无法御刀而行，所以打算给自己的刀装上什么？",
  answer: "护栏"
};
const _0x36fdb9 = {
  keys: "主角穿越之后在天上飘了十几万年才下来的小说，是以下哪一本？",
  answer: "黎明之剑"
};
const _0x4dfb8d = {
  keys: "以下哪个人物不是出自作家天下霸唱的作品？",
  answer: "王建国"
};
const _0x1fe0a4 = {
  keys: "《超神宠兽店》是近期值得一看的战宠文，这本书的作者还创作了知名黑暗文《黑暗王者》，请问作者是？",
  answer: "古羲"
};
const _0x4525db = {
  keys: "以下谁是《雪中悍刀行》中的人物？",
  answer: "徐凤年"
};
const _0x415fa1 = {
  keys: "《帝霸》主角为了找丢失的__误入疯魔洞？",
  answer: "羊"
};
const _0x24090b = {
  keys: "《万族之劫》火爆全网，这本书不仅好看，更新也十分给力，2020年12月，作者竟然更新了__字？",
  answer: "83万字"
};
const _0x411535 = {
  keys: "一位道士在路边摆摊，面前放着三本秘籍，你认为最贵的功法是？",
  answer: "《五年高考三年模拟》"
};
const _0x5910ab = {
  keys: "《万族之劫》主角叫？",
  answer: "苏宇"
};
const _0x39fea4 = {
  keys: "《无限恐怖》中，主角郑吒经历的第一个恐怖世界是？",
  answer: "生化危机"
};
const _0x126e46 = {
  keys: "《遮天》的主角叫什么？",
  answer: "叶凡"
};
const _0x270f97 = {
  keys: "《帝霸》主角为了找丢失的__误入疯魔洞？",
  answer: "羊"
};
const _0x259c16 = {
  keys: "《万族之劫》火爆全网，这本书不仅好看，更新也十分给力，2020年12月，作者竟然更新了__字？",
  answer: "83万字"
};
const _0x4ebc1d = {
  keys: "一位道士在路边摆摊，面前放着三本秘籍，你认为最贵的功法是？",
  answer: "《五年高考三年模拟》"
};
const _0x32e4d1 = {
  keys: "《万族之劫》主角叫？",
  answer: "苏宇"
};
const _0x196cf8 = {
  keys: "《锦衣之下》女主袁今夏的职业是什么",
  answer: "捕快"
};
const _0x3991e8 = {
  keys: "《锦衣之下》原著作者是谁？",
  answer: "蓝色狮"
};
const _0x40945d = {
  keys: "《凡人修仙传》中主角被谁收为弟子",
  answer: "墨大夫"
};
const _0x598916 = {
  keys: "《凡人修仙传》中主角韩立家里排行老几？",
  answer: "老四"
};
const _0x3eaffe = {
  keys: "2011年由于杨幂主演的影视剧《宫》，又名 ？",
  answer: "宫锁心玉"
};
const _0x4eb18a = {
  keys: "如果你穿越到古代成为一个庶女 \n你应该？",
  answer: "宅斗创业嫁入豪门"
};
const _0x5e2ffb = {
  keys: "由王凯主演的影视剧《清平乐》改编自以下哪部网文作品？",
  answer: "孤城闭"
};
const _0x47a193 = {
  keys: "路边看到一只纯黑色的小猫一直盯着你，你应该?",
  answer: "立马打包带走，回家洗洗就能变帅哥"
};
const _0x3001ab = {
  keys: "电影《少年的你》拍摄地点在哪里？",
  answer: "重庆"
};
const _0x174842 = {
  keys: "《斗破苍穹》中萧炎在大千世界创建势力叫什么",
  answer: "无尽火域"
};
const _0x578767 = {
  keys: "袁冰妍在影视剧《听雪楼》中，饰演了哪一个角色？",
  answer: "舒靖容"
};
const _0x1d53cc = {
  keys: "电影《晴雅集》中饰演博雅一角的演员是？",
  answer: "邓伦"
};
const _0x51d6e8 = {
  keys: "《龙族》的主角是谁？",
  answer: "路明非"
};
const _0xb0ed29 = {
  keys: "请问女主女扮男装，男主怎么才可以知道她是个女孩子？",
  answer: "摸胸"
};
const _0x3206cf = {
  keys: "网剧《三千鸦杀》中男主傅九云的真实身份是？",
  answer: "灵灯灯芯"
};
const _0x5451e7 = {
  keys: "《吞噬星空》的故事，发生在什么年代？",
  answer: "未来"
};
const _0x1e20c2 = {
  keys: "请问古代太医一把脉说的一句话是什么？",
  answer: "有喜了"
};
const _0x58634b = {
  keys: "章子怡在影视剧《上阳赋》中饰演了哪一个角色？",
  answer: "王儇"
};
const _0x56d38b = {
  keys: "《长安十二时辰》中易烊千玺扮演的角色叫什么",
  answer: "李必"
};
const _0x3d9db8 = {
  keys: "《星辰变》的主角秦羽，有两个妖兽兄弟。是什么动物？",
  answer: "鹰和猿"
};
const _0xd0a8d0 = {
  keys: "唐家三少的《生肖守护神》哪个属相是“老大”？",
  answer: "麒麟"
};
const _0x3df5c9 = {
  keys: "《亏成首富从游戏开始》中主角公司有一个宅男每次都因为莫名其妙的原因而被奖励外出旅行，不是在旅行就是在去旅行的路上，这位宅男是",
  answer: "旅行者包旭"
};
const _0x5be8ce = {
  keys: "《斗破苍穹》纳兰嫣然为什么会和主角萧炎悔婚？",
  answer: "没有实力"
};
const _0x36ec47 = {
  keys: "下列哪本小说的爱情故事没有经历多个轮回？",
  answer: "三生门"
};
const _0x8a0678 = {
  keys: "小说《全职高手》的游戏名字叫什么？",
  answer: "荣耀"
};
const _0x32a915 = {
  keys: "人不彪悍枉少年讲述的是热血少年花彪和谁的青春故事",
  answer: "飞车五人组"
};
const _0x3eef9e = {
  keys: "网剧《我叫余欢水》改编自以下哪部小说？",
  answer: "如果没有明天"
};
const _0x3edfb6 = {
  keys: "哪本书的主角最稳健？",
  answer: "我师兄实在是太稳健了"
};
const _0x3f8fd9 = {
  keys: "《传闻中的陈芊芊》中陈芊芊的青梅竹马是",
  answer: "裴恒"
};
const _0xfb283e = {
  keys: "玄幻小说剧《斗罗大陆》中唐三与小舞初遇的地点是？",
  answer: "诺丁学院"
};
const _0x646465 = {
  keys: "以下哪本小说的故事没有发生在架空世界？",
  answer: "活着"
};
const _0x5191ac = {
  keys: "《开局签到荒古圣体》中的荒古圣体出自下列哪本小说？",
  answer: "遮天"
};
const _0xff7017 = {
  keys: "《鬼吹灯》小说情节“在墓的东南角点蜡烛”的原因是？",
  answer: "摸金校尉业内守则"
};
const _0x442c68 = {
  keys: "网文小说作者尾鱼以写什么题材的小说出名？",
  answer: "惊悚文"
};
const _0x5c582e = {
  keys: "以下哪位作者是女性？",
  answer: "陈词懒调"
};
const _0x48549c = {
  keys: "《斗破苍穹》是哪一年开始在网上连载的？",
  answer: "2009年"
};
const _0x1ab1d5 = {
  keys: "下列哪个游戏是由小说改编而成？",
  answer: "诛仙"
};
const _0x1b6751 = {
  keys: "下列哪部小说不属于“网络三大奇书”？",
  answer: "《斗破苍穹》"
};
const _0x1c52aa = {
  keys: "《轮回乐园》作为一本长期霸榜的漫综无限流作品，即将突破1000万字。请问这本小说的作者是？",
  answer: "那一只蚊子"
};
const _0x731391 = {
  keys: "《大奉打更人》的作者是？",
  answer: "卖报小郎君"
};
const _0x390140 = {
  keys: "以下影视中哪部不属于由顾漫作品改编？",
  answer: "冰糖炖雪梨"
};
const _0x356806 = {
  keys: "杨幂在影视剧《美人心计》中饰演了哪个角色？",
  answer: "莫雪鸢"
};
const _0x66b6a0 = {
  keys: "下列哪一部片名里没有同时包含男女主人公的名字？",
  answer: "泡沫之夏"
};
const _0x162cb7 = {
  keys: "《吞噬星空》的作者是谁？",
  answer: "我吃西红柿"
};
const _0x18fffe = {
  keys: "《盗墓笔记》的张起灵的别称叫什么",
  answer: "闷油瓶"
};
const _0x41f7c7 = {
  keys: "《都市极品医神》的主角叫什么？",
  answer: "叶辰"
};
const _0x1f3a8b = {
  keys: "《遮天》中狠人大帝“不为成仙，只为红尘中等你归来。”，等待的是谁？",
  answer: "哥哥"
};
const _0x2ba279 = {
  keys: "《从零开始》更新了数年，近两千万字，才终于完结。请问从零开始更新了几年？",
  answer: "11年"
};
const _0x50c4de = {
  keys: "以下哪本网络小说2020年带火了一个流派？",
  answer: "诡秘之主"
};
const _0x52faf7 = {
  keys: "小说《赘婿》改编的电视剧男主角是？",
  answer: "郭麒麟"
};
const _0x2b903e = {
  keys: "影视剧《上阳赋》改编自以下哪位作者的小说？",
  answer: "寐语者"
};
const _0x9b5902 = {
  keys: "《悟空传》的作者叫什么",
  answer: "今何在"
};
const _0x2a80af = {
  keys: "以下不是南派三叔的作品的是？",
  answer: "《庆余年》"
};
const _0x48ca89 = {
  keys: "由张杰演唱歌曲《剑心》是以下哪部电视剧的主题曲？",
  answer: "古剑奇谭"
};
const _0x20b3bb = {
  keys: "《美食供应商》中男主拥有什么系统？",
  answer: "厨神系统"
};
const _0x2b2753 = {
  keys: "穿越到古代，不得不种田糊口，你应该？",
  answer: "翻箱倒柜，看能不能找到传家秘宝开启空间"
};
const _0x345f86 = {
  keys: "《掌中之物》的男主叫什么名字",
  answer: "傅慎行"
};
const _0x1b82c2 = {
  keys: "影视剧《三生三世十里桃花》中出现的成玉元君是以下哪部小说中的主人公？",
  answer: "三生三世步生莲"
};
const _0x11453a = {
  keys: "影视剧《香蜜沉沉烬如霜》中锦觅的母亲是？",
  answer: "花神"
};
const _0x20985a = {
  keys: "《古董局中局》和《长安十二时辰》是同一人的作品吗？",
  answer: "是"
};
const _0x1f4d98 = {
  keys: "《冠军之心》《胜者为王》《我们是冠军》这几本小说主要围绕哪种体育运动展开？",
  answer: "足球"
};
const _0x1dc4cc = {
  keys: "网剧《我就是这般的女子》改编自以下哪位作者的小说作品？",
  answer: "月下蝶影"
};
const _0x8010d1 = {
  keys: "下列哪个游戏是由小说改编而成？",
  answer: "诛仙"
};
const _0x44c7bd = {
  keys: "影视剧《将夜》中，被称为“天下三痴之书痴”的角色是？",
  answer: "莫山山"
};
const _0x3ed3de = {
  keys: "《间客》主角叫？",
  answer: "许乐"
};
const _0x29d532 = {
  keys: "女主突然呕吐，请问她怎么了？",
  answer: "吃多了"
};
const _0x1d3d53 = {
  keys: "《一起来看流星雨》中饰演“楚雨荨”一角的演员是？",
  answer: "郑爽"
};
const _0x3ead66 = {
  keys: "以下哪些演员没有饰演过吴邪？",
  answer: "杨洋"
};
const _0x4ed21d = {
  keys: "电视剧《下一站是幸福》于哪一年在湖南卫视首播？",
  answer: "2020年"
};
const _0x1130d = {
  keys: "《一起来看流星雨》于哪一年在湖南卫视首播？",
  answer: "2009年"
};
const _0x15942d = {
  keys: "以下谁没有“坑神”之称？",
  answer: "叶良辰"
};
const _0x5521de = {
  keys: "以男性为主角的苏文叫？",
  answer: "汤姆苏"
};
const _0x2d0801 = {
  keys: "旋风少女的原著作者是谁",
  answer: "明晓溪"
};
const _0x314b16 = {
  keys: "影视剧《有匪》中由赵丽颖饰演的角色是？",
  answer: "周翡"
};
const _0x1b8c7f = {
  keys: "网剧《狐狸的夏天》改编自以下哪部网络小说？",
  answer: "当总裁恋爱时"
};
const _0x639cab = {
  keys: "《吞噬星空》的主角叫什么？",
  answer: "罗峰"
};
const _0x10f7e0 = {
  keys: "下面哪个情节女主的手受伤几率比较低？",
  answer: "打架"
};
const _0xdfc63d = {
  keys: "《恶魔法则》所在帝国叫什么帝国",
  answer: "罗兰帝国"
};
const _0x2fe21b = {
  keys: "以下哪部作品不是“清穿文三座大山”？",
  answer: "《我本闲凉》"
};
const _0x54cda9 = {
  keys: "以下哪本小说中的主角没有开后宫？",
  answer: "万族之劫"
};
const _0x39dee4 = {
  keys: "电视剧《下一站是幸福》中饰演贺繁星的演员是？",
  answer: "宋茜"
};
const _0x28619c = {
  keys: "你突然穿越到玄幻修真世界，开局一个废灵根，你应该？",
  answer: "暗自狂喜，主角人设已就位坐等飞升"
};
const _0x3eb5be = {
  keys: "《盘龙》书中的“盘龙”，是个什么器物？",
  answer: "戒指"
};
const _0x5a2f43 = {
  keys: "杨洋和迪丽热巴主演的影视剧《你是我的荣耀》原著作者是？",
  answer: "顾漫"
};
const _0x524d0e = {
  keys: "一觉醒来你发现窗外丧尸横行，你应该？",
  answer: "睡个回笼觉，看看能觉醒什么异能"
};
const _0x59d1a0 = {
  keys: "以下哪位女演员演过网文改编电视剧的男性角色？",
  answer: "张天爱"
};
const _0x2c163c = {
  keys: "以下哪个是小说《斗罗大陆》中奥斯卡制作恢复香肠的咒语？",
  answer: "老子有根大香肠"
};
const _0x592797 = {
  keys: "下列哪本小说不是电竞言情小说?",
  answer: "冰糖炖雪梨"
};
const _0x50f37b = {
  keys: "以下哪本小说故事背景没有发生在唐朝？",
  answer: "唐门贵女"
};
const _0x1e25a1 = {
  keys: "《长安十二时辰》中张小敬的职位是什么？",
  answer: "不良人"
};
const _0x58b3be = {
  keys: "电视剧《狼殿下》中王大陆饰演了哪一个角色？",
  answer: "楚有炆"
};
const _0x2d6c31 = {
  keys: "修真小说中不需要以下哪种气体修炼？",
  answer: "脚气"
};
const _0xf8791f = {
  keys: "下列哪个小说的主角没有动物朋友？",
  answer: "范闲"
};
const _0x1522ac = {
  keys: "《凡人修仙传》作者忘语最新力作《大梦主》正在火热连载，请问《大梦主》的主角叫什么",
  answer: "沈落"
};
const _0x4eef9a = {
  keys: "小说中“桀桀桀”是是什么意思？",
  answer: "笑声"
};
const _0x489fbb = {
  keys: "《斗破苍穹》中排名第三的异火叫什么？",
  answer: "净莲妖火"
};
const _0x346e70 = {
  keys: "下班路上，突然有个受伤的人把你按在墙角，你应该？",
  answer: "满心欢喜，准备带他回家等待大佬的报恩"
};
const _0x32dd6d = {
  keys: "你在古玩街淘到一价值连城的青铜剑，正心情激动之际，手突然被其划伤，然后你可能会……",
  answer: "因破伤风住院"
};
const _0x609521 = {
  keys: "以下三本神作，字数超过500万的是？",
  answer: "《万族之劫》"
};
const _0x5b38ee = {
  keys: "《仙逆》是白金作者“耳根”的代表作之一 ，请问这部作品的主角是？",
  answer: "王林"
};
const _0xb61ec3 = {
  keys: "《清平乐》中公主徽柔与谁相爱？",
  answer: "太监"
};
const _0x490338 = {
  keys: "《山海情》中实际发生地是哪里？",
  answer: "宁夏"
};
const _0x3456b3 = {
  keys: "请问什么情况老天会下大雨？",
  answer: "以上全部"
};
const _0x11bfda = {
  keys: "《我的徒弟都是大反派》中主角重生后成了魔道老祖，徒弟全是大反派，请问主角有几个徒弟？",
  answer: "9个"
};
const _0x4226f2 = {
  keys: "以下哪本小说的女主角不是美食达人？",
  answer: "草莓印"
};
const _0x4b5d9b = {
  keys: "以下哪个小说中的女主角不是重生一世的？",
  answer: "神医嫡女"
};
const _0x5ae5ff = {
  keys: "以下哪本小说不是网文作家鲜橙的作品？",
  answer: "表小姐"
};
const _0x55497f = {
  keys: "“上交给国家”是哪部小说被影视化的梗？",
  answer: "《盗墓笔记》"
};
const _0x3d2a95 = {
  keys: "被称为网络小说五大至高神作家是哪些？",
  answer: "东红，西豆，南机，北唐，中辰东"
};
const _0x28fd36 = {
  keys: "《斗破苍穹》中第一个和萧炎在一起的女性角色是谁？",
  answer: "彩鳞（美杜莎）"
};
const _0xeab707 = {
  keys: "开辟的仙侠新潮流被称为“烂柯流”文的书是以下哪本？",
  answer: "《烂柯棋缘》"
};
const _0x1cc92d = {
  keys: "以下哪本小说有老爷爷类型的金手指？",
  answer: "《盘龙》"
};
const _0xca77f9 = {
  keys: "《诛仙》的作者是？",
  answer: "萧鼎"
};
const _0x351b65 = {
  keys: "主角获得亏钱系统，亏钱等于赚钱。但主角想赔钱，却总是赔不了的小说是?",
  answer: "《亏成首富从游戏开始》"
};
const _0x52718b = {
  keys: "《回到明朝当王爷》因为是几世善人而被地府转世到了古代？",
  answer: "九世"
};
const _0x4eadee = {
  keys: "主角为了保护地球，独自与宇宙巨兽战斗，绝望之际夺舍了巨兽的身体，获得了吞噬万物的天赋，这本小说是？",
  answer: "《吞噬星空》"
};
const _0x3bbe82 = {
  keys: "《生活系游戏》是一部非常促进食欲的美食文，其中描写了非常多的奇妙美食，令人回味无穷。主角最擅长做的是？",
  answer: "八宝粥"
};
const _0x160aa4 = {
  keys: "《三体》中是谁劫持一搜太空舰逃离为人类保存文明火种",
  answer: "章北海"
};
const _0xf81d7d = {
  keys: "“如果世界上曾经有那个人出现过，其他人都会变成将就，而我不愿意将就。”这句话出自哪本小说？",
  answer: "何以笙箫默"
};
const _0x5598c0 = {
  keys: "《灵域》男主角秦烈电视剧扮演者是谁？",
  answer: "范丞丞"
};
const _0x2f7803 = {
  keys: "《大秦赋》中嬴政的扮演者是谁？",
  answer: "张鲁一"
};
const _0x47eb7a = {
  keys: "以下哪位演员没演过网文改编的电视剧？",
  answer: "葛优"
};
const _0x310930 = {
  keys: "胎穿到古代成为皇子之一，你应该？",
  answer: "卖萌装傻，争取安全长大做个闲散王爷"
};
const _0x1336e1 = {
  keys: "《无限恐怖》的主角叫什么？",
  answer: "郑吒"
};
const _0x33339b = {
  keys: "把流眼泪形容成兰州拉面的是哪位作者？",
  answer: "紫金陈"
};
const _0x411282 = {
  keys: "《万族之劫》火爆全网，这本书不仅好看，更新也十分给力，以下不属于书中的势力是",
  answer: "大河府"
};
const _0x519a0d = {
  keys: "主角的金手指是吃饭等于吃补药，开创“饭桶流派”的小说是哪本？",
  answer: "《从大佬到武林盟主》"
};
const _0x5c468d = {
  keys: "电视剧《古剑奇谭》中风晴雪的身份是？",
  answer: "幽都灵女"
};
const _0x1f78ef = {
  keys: "《盗墓笔记》的主角叫什么",
  answer: "吴邪"
};
const _0x1cbd95 = {
  keys: "《龙族》陈墨瞳的小名叫什么",
  answer: "诺诺"
};
const _0x25b1bb = {
  keys: "庆余年武力值最高的是谁？",
  answer: "五竹"
};
const _0x1ec3e8 = {
  keys: "开启盗墓一脉的是以下哪本书？",
  answer: "《鬼吹灯》"
};
const _0x2f660f = {
  keys: "当你看到小区里有只猫在遛狗不要惊讶，因为它可能是重生者，这情景会出现在哪本书？",
  answer: "《回到过去变成猫》"
};
const _0x2e6ef2 = {
  keys: "《大王饶命》主角吕树的妹妹叫什么？",
  answer: "吕小鱼"
};
const _0x14ba95 = {
  keys: "张碧晨演唱歌曲《年轮》是以下哪部电视剧的插曲？",
  answer: "花千骨"
};
const _0x27f5a1 = {
  keys: "《山海情》男主角马得福的扮演者是谁？",
  answer: "黄轩"
};
const _0x1ca1fc = {
  keys: "电视剧《下一站是幸福》中饰演元宋的演员是？",
  answer: "宋威龙"
};
const _0x51cf75 = {
  keys: "《剑来》是谁写的小说？",
  answer: "烽火戏诸侯"
};
const _0x5386e6 = {
  keys: "《斗破苍穹》主角叫什么名字",
  answer: "萧炎"
};
const _0x22acc5 = {
  keys: "郭珍霓在影视剧《华胥引》中一人分饰了几个角色？",
  answer: "2"
};
const _0x4f676b = {
  keys: "以下哪部是由大ip小说改编的电视剧？",
  answer: "长安十二时辰"
};
const _0x2f3e42 = {
  keys: "穿越到末世文，发现男主黑化要毁灭世界，你应该？",
  answer: "找到女主，撮合恋情就能拯救世界"
};
const _0x404254 = {
  keys: "口头禅“我还有机会吗”的张东升老师，是教什么的？",
  answer: "数学"
};
const _0x57f942 = {
  keys: "《我的绝色美女房客》中开光镜用的丹药名是？",
  answer: "血玉丹"
};
const _0xc3085f = {
  keys: "以下哪位明星没有饰演过“白浅”这一角色？",
  answer: "李一桐"
};
const _0x4054de = {
  keys: "由李易峰主演的影视剧《镜·双城》原著作者是？",
  answer: "沧月"
};
const _0x305501 = {
  keys: "《锦衣之下》发生在什么朝代",
  answer: "明"
};
const _0x442149 = {
  keys: "“时代姐妹花”是以下哪部电影中的主角团体？",
  answer: "小时代"
};
const _0x14ad28 = {
  keys: "《鬼吹灯》的主角叫什么名字",
  answer: "胡八一"
};
const _0x802672 = {
  keys: "《诛仙》中，作者引用了道德经中的一句话：“天地不仁，以万物为__！”",
  answer: "刍狗"
};
const _0x17c02d = {
  keys: "《诛仙》的主角叫什么名字",
  answer: "张小凡"
};
const _0x461029 = {
  keys: "以下哪本的男主不是影帝？",
  answer: "《全娱乐圈等我C位出道》"
};
const _0xde58a = {
  keys: "刘诗诗在影视剧《流金岁月》中饰演了哪一个角色？",
  answer: "蒋南孙"
};
const _0x5d5b37 = {
  keys: "周冬雨在电影《少年的你》中饰演了哪一个角色？",
  answer: "陈念"
};
const _0x5dad09 = {
  keys: "《传闻中的陈芊芊》里男主角的名字叫什么？",
  answer: "韩烁"
};
const _0x46a986 = {
  keys: "《间客》作者是谁",
  answer: "猫腻"
};
const _0x3741f7 = {
  keys: "网文改编剧《三千鸦杀》的原著作者是？",
  answer: "十四郎"
};
const _0x2a7d7b = {
  keys: "《诡秘之主》中星之海盗团的统领是谁？",
  answer: "嘉德丽雅"
};
const _0x5f2d31 = {
  keys: "以下哪部影视剧的原著小说有“清穿三座大山”的美誉？",
  answer: "步步惊心"
};
const _0x5ac28a = {
  keys: "《山海情》李水花的扮演者是谁？",
  answer: "热依扎"
};
const _0x4345f6 = {
  keys: "电影版《三生三世十里桃花》饰演男主角夜华的明星是？",
  answer: "杨洋"
};
const _0x53279e = {
  keys: "《吞噬星空》主角叫什么？",
  answer: "罗峰"
};
const _0x524b2a = {
  keys: "去爬山突然失足，你应该？",
  answer: "沉着冷静，等待穿越"
};
const _0x5891c3 = {
  keys: "《从前有座灵剑山》的男主人公扮演者叫什么",
  answer: "许凯"
};
const _0x55d382 = {
  keys: "微微一笑很倾城女主叫什么",
  answer: "贝微微"
};
const _0x4bb978 = {
  keys: "如果你穿越到小说中成了一名反派，你应该？",
  answer: "逃离人设，暗中抱紧主角大腿"
};
const _0x32061a = {
  keys: "《鬼吹灯》中盗墓者的别称叫什么",
  answer: "摸金校尉"
};
const _0x3b0042 = {
  keys: "《如懿传》是发生在哪个皇帝时期的事情",
  answer: "乾隆"
};
const _0x564c09 = {
  keys: "《庆余年》电视剧中，郭麒麟所扮演的角色叫什么？",
  answer: "范思辙"
};
const _0x375bed = {
  keys: "在古装剧中，下面几个人的人设是什么样子的？公主、闺秀、秀才",
  answer: "刁蛮、病弱、不要命"
};
const _0xf9ff83 = {
  keys: "《庆余年》中五竹眼睛总是蒙着一条黑布，令人感觉深不可测，那他的真实身份是什么？",
  answer: "上古文明的高科技机器人"
};
const _0x1a2bdf = {
  keys: "网剧《狐狸的夏天》的女主角是谁？",
  answer: "谭松韵"
};
const _0x3071cf = {
  keys: "《斗罗大陆》的作者是谁？",
  answer: "唐家三少"
};
const _0x1dfc3d = {
  keys: "《古董局中局》的作者是谁？",
  answer: "马伯庸"
};
const _0x181262 = {
  keys: "《隐秘的角落》主角叫什么名字",
  answer: "朱朝阳"
};
const _0x4ba7a3 = {
  keys: "影视剧《知否知否应是绿肥红瘦》改编自以下哪位作者的同名小说？",
  answer: "关心则乱"
};
const _0x48454a = {
  keys: "任何人可以在这里买到想要的任何东西，金钱、寿命、容颜，只要付出足够的代价。……这句话是以下哪本小说的设定？",
  answer: "《特拉福买家俱乐部》"
};
const _0x126cf1 = {
  keys: "影视剧《大江大河》中饰演“宋运辉”的演员是？",
  answer: "王凯"
};
const _0x4f1632 = {
  keys: "《诛仙》主角的师傅，大竹峰首座是谁？",
  answer: "田不易"
};
const _0x299a20 = {
  keys: "王丽坤在影视剧《美人心计》中一人分饰了几个角色？",
  answer: "2"
};
const _0x290e76 = {
  keys: "《龙族》的作者是？",
  answer: "江南"
};
const _0x54cb80 = {
  keys: "历史上被公认为我国第一本网络小说是以下哪一部？",
  answer: "《第一次亲密接触》"
};
const _0x3b1176 = {
  keys: "电视剧《狼殿下》中李沁饰演了哪一个角色？",
  answer: "马摘星"
};
const _0x15e67e = {
  keys: "影视剧《三生三世十里桃花》的原著作者是谁？",
  answer: "唐七"
};
const _0x511ab4 = {
  keys: "琅琊榜中梅长苏的原名叫什么",
  answer: "林殊"
};
const _0x270031 = {
  keys: "《明日之劫》《难道我是神》《旧日之箓》是哪位大神作者的作品？",
  answer: "熊狼狗"
};
const _0x5889f8 = {
  keys: "《斗破苍穹》中，萧炎上了几次云岚宗。",
  answer: "3"
};
const _0x193779 = {
  keys: "以下哪部影视剧不属于由言情作家十四郎的作品改编？",
  answer: "《人民的名义》"
};
const _0x424aa2 = {
  keys: "网络剧《最好的我们》改编自以下哪位作者的同名小说？",
  answer: "八月长安"
};
const _0x5d9fd3 = {
  keys: "《诡秘之主》中愚者先生的小号是",
  answer: "世界"
};
const _0x636fab = {
  keys: "掌中之物改名电视剧叫什么",
  answer: "阳光之下"
};
const _0x1f8482 = {
  keys: "《斗罗大陆》的男主角叫什么？",
  answer: "唐三"
};
const _0x1e3eba = {
  keys: "影视剧《将夜》中，被称为“天下三痴之道痴”的角色是？",
  answer: "叶红鱼"
};
const _0xecef33 = {
  keys: "《且试天下》是以下哪位作家的作品？",
  answer: "倾泠月"
};
const _0x5411a5 = {
  keys: "在总裁文中，女主怀孕一胎最多会生几个孩子？",
  answer: "一胎10宝"
};
const _0x241e11 = {
  keys: "秦俊杰在影视剧《听雪楼》中，饰演了哪一个角色？",
  answer: "萧忆情"
};
const _0x498896 = {
  keys: "电视剧《古剑奇谭》中百里屠苏的原名叫什么？",
  answer: "韩云溪"
};
const _0x37adfc = {
  keys: "主角建立了一个组织，叫“炸天帮”。号称有百万帮众，然而帮里的所有人都是主角自己扮演的，这本小说是？",
  answer: "《最强反套路系统》"
};
const _0x1742d8 = {
  keys: "影视剧《华胥引》中饰演“宋凝”的演员是？",
  answer: "蒋欣"
};
const _0x523baa = {
  keys: "穿成总裁文中总裁的白月光，你应该？",
  answer: "远离总裁，以防成为女主炮灰"
};
const _0x561d72 = {
  keys: "开启修仙流的是哪位作者的哪本书？",
  answer: "萧潜 《飘渺之旅》"
};
const _0x4f3079 = {
  keys: "《全职高手》中叶修在新开的第十区首杀？",
  answer: "暗夜猫妖"
};
const _0x517243 = {
  keys: "《斗罗大陆》的主角唐三，穿越前是哪个门派的外门弟子。",
  answer: "唐门"
};
const _0x49c504 = {
  keys: "以下哪本不是总裁文？",
  answer: "《才不要和老板谈恋爱》"
};
let _0x11f033 = [_0x21f3e1, _0xdf7dda, _0x3bf2f9, _0x291d16, _0x59c7ea, _0x2ae68e, _0x1d72fc, _0x1a0896, _0x45e8fa, _0x271ab2, _0x1d550b, _0x1467d1, _0x5b5f30, _0x228c9c, _0x3703d3, _0x2e69de, _0x290454, _0x483e0f, _0x321579, _0x2b0fe9, _0x1e1f51, _0x16fd82, _0x4e9345, _0x121863, _0x3c6349, _0x58259a, _0x5d53c9, _0x5954f9, _0x2b0cfb, _0x5365d4, _0x18abd1, _0x2bee1e, _0x4b2025, _0x4fd5cd, _0x572fb0, _0x382f39, _0x4187f1, _0x553bc1, _0x65060b, _0x57a8f5, _0x4ad0cd, _0x1a465e, _0xd7bd1a, _0x4a14ad, _0x4f0233, _0x520ec9, _0x1d7b5c, _0x3ec8f0, _0x45ed32, _0x280be9, _0x50f371, _0x2d6fc2, _0x43db7a, _0x48abeb, _0x18ea4f, _0x1a1ddf, _0x5730e0, _0x47b718, _0x2c90b6, _0x56f6d3, _0x47b07d, _0x1b3005, _0x2b56a0, _0x3e7346, _0x10ab8d, _0xb34ccc, _0x45c5ec, _0x45fe24, _0x241bc2, _0x363465, _0x4a36de, _0x200c20, _0x45c0f8, _0x549537, _0x39ec08, _0xb92c80, _0x5502ef, _0x3a0191, _0x3240d1, _0x3e32a4, _0x2fdd08, _0x32722b, _0x58a1f2, _0x56fc62, _0x140853, _0x455eed, _0x24cfea, _0x1359a8, _0x22dcde, _0x376ab2, _0x540f4e, _0x77a76b, _0xfdb1b3, _0x4489a0, _0x5da9e8, _0x7191bb, _0x2d8b92, _0x194938, _0x53e254, _0x37b172, _0x10e50d, _0x50d3ab, _0x6486e8, _0x5801fb, _0x2f5964, _0x5cd2fe, _0x37e514, _0x2d80d7, _0x104bec, _0xe60ffa, _0x139e27, _0x5baef4, _0x41d517, _0x560187, _0x4b5c58, _0x1a5929, _0x4596d9, _0x4290bd, _0x3188d2, _0x1bfc5e, _0x18b501, _0x425acb, _0x55d546, _0x36dbfe, _0x174a58, _0x1b4621, _0x357aa0, _0x3420da, _0x3e7020, _0x179c51, _0x24839c, _0x49d2b3, _0x13e399, _0x822223, _0x5af78b, _0x3b276d, _0x5253ed, _0x54bf58, _0x10743e, _0xcacda, _0x4136f9, _0x51431e, _0x1871bf, _0x5aa0a0, _0x51de66, _0x36c7c6, _0x139266, _0x4cbd96, _0x126c45, _0x301694, _0x1be2aa, _0x42d28b, _0x3059e4, _0x23b7e5, _0x4ee767, _0x308613, _0x5d0f1e, _0x5b16c9, _0x2eac22, _0x348c33, _0x58c13f, _0x458572, _0x33695e, _0x323a0d, _0x3a8899, _0xea1f5b, _0x1fb55a, _0x3ec75e, _0x31cd6d, _0x45078e, _0x4f8bbf, _0x44ff27, _0x46424d, _0x3053d1, _0x1fba5a, _0x23e9e4, _0x26eaf2, _0x4e0986, _0x1c4a5f, _0x46c75d, _0x562911, _0x3403c1, _0x5b53ca, _0x56acc0, _0x13ee06, _0x44a4d0, _0x57f9d3, _0x31718d, _0xaff70e, _0xda68f2, _0x2404d3, _0x38122c, _0x45df43, _0x248487, _0x3d1bc5, _0x51f2ee, _0x1c0833, _0x5dc756, _0xda2159, _0x10469c, _0x49cc63, _0x2c374a, _0x5e7352, _0x1ee479, _0x78eb9a, _0x5d6c41, _0x514423, _0x42a438, _0x164a94, _0x4911f2, _0x1eab1f, _0x12f00a, _0x1741bc, _0x28af93, _0x2fe019, _0x5a32ad, _0x5eb801, _0x301dde, _0x141345, _0xf8dec7, _0x53e544, _0x4d8a24, _0x5f5349, _0x1fa30e, _0x45a704, _0x46820b, _0x5cb72e, _0x4b4830, _0x2c276c, _0x3b70cd, _0x4fb4e2, _0x567574, _0x28a4e3, _0x312c7a, _0x757ea4, _0x5d8f58, _0x32ba75, _0x19a632, _0x3d2814, _0x573644, _0x3f2260, _0x35f7a5, _0x3edb93, _0x37fe30, _0x58cd79, _0x360e46, _0x589d52, _0x2a4d6b, _0x3a645b, _0x21e3f7, _0x5a7412, _0x22e22e, _0x4adc0d, _0x55dbea, _0x32c19d, _0x124d33, _0x5b52ba, _0x5194b7, _0x41e7a0, _0x419911, _0x24450c, _0x1f6839, _0x3b646b, _0x147029, _0x108c6f, _0x2e7b96, _0x5a8091, _0x52c385, _0x353b16, _0x247bab, _0x105a94, _0xc6581c, _0x46f67f, _0x4af51e, _0x542bf4, _0x51836b, _0x2ffd28, _0x272905, _0x3d5399, _0x2ab640, _0x2486a1, _0x36fdb9, _0x4dfb8d, _0x1fe0a4, _0x4525db, _0x415fa1, _0x24090b, _0x411535, _0x5910ab, _0x39fea4, _0x126e46, _0x270f97, _0x259c16, _0x4ebc1d, _0x32e4d1, _0x196cf8, _0x3991e8, _0x40945d, _0x598916, _0x3eaffe, _0x4eb18a, _0x5e2ffb, _0x47a193, _0x3001ab, _0x174842, _0x578767, _0x1d53cc, _0x51d6e8, _0xb0ed29, _0x3206cf, _0x5451e7, _0x1e20c2, _0x58634b, _0x56d38b, _0x3d9db8, _0xd0a8d0, _0x3df5c9, _0x5be8ce, _0x36ec47, _0x8a0678, _0x32a915, _0x3eef9e, _0x3edfb6, _0x3f8fd9, _0xfb283e, _0x646465, _0x5191ac, _0xff7017, _0x442c68, _0x5c582e, _0x48549c, _0x1ab1d5, _0x1b6751, _0x1c52aa, _0x731391, _0x390140, _0x356806, _0x66b6a0, _0x162cb7, _0x18fffe, _0x41f7c7, _0x1f3a8b, _0x2ba279, _0x50c4de, _0x52faf7, _0x2b903e, _0x9b5902, _0x2a80af, _0x48ca89, _0x20b3bb, _0x2b2753, _0x345f86, _0x1b82c2, _0x11453a, _0x20985a, _0x1f4d98, _0x1dc4cc, _0x8010d1, _0x44c7bd, _0x3ed3de, _0x29d532, _0x1d3d53, _0x3ead66, _0x4ed21d, _0x1130d, _0x15942d, _0x5521de, _0x2d0801, _0x314b16, _0x1b8c7f, _0x639cab, _0x10f7e0, _0xdfc63d, _0x2fe21b, _0x54cda9, _0x39dee4, _0x28619c, _0x3eb5be, _0x5a2f43, _0x524d0e, _0x59d1a0, _0x2c163c, _0x592797, _0x50f37b, _0x1e25a1, _0x58b3be, _0x2d6c31, _0xf8791f, _0x1522ac, _0x4eef9a, _0x489fbb, _0x346e70, _0x32dd6d, _0x609521, _0x5b38ee, _0xb61ec3, _0x490338, _0x3456b3, _0x11bfda, _0x4226f2, _0x4b5d9b, _0x5ae5ff, _0x55497f, _0x3d2a95, _0x28fd36, _0xeab707, _0x1cc92d, _0xca77f9, _0x351b65, _0x52718b, _0x4eadee, _0x3bbe82, _0x160aa4, _0xf81d7d, _0x5598c0, _0x2f7803, _0x47eb7a, _0x310930, _0x1336e1, _0x33339b, _0x411282, _0x519a0d, _0x5c468d, _0x1f78ef, _0x1cbd95, _0x25b1bb, _0x1ec3e8, _0x2f660f, _0x2e6ef2, _0x14ba95, _0x27f5a1, _0x1ca1fc, _0x51cf75, _0x5386e6, _0x22acc5, _0x4f676b, _0x2f3e42, _0x404254, _0x57f942, _0xc3085f, _0x4054de, _0x305501, _0x442149, _0x14ad28, _0x802672, _0x17c02d, _0x461029, _0xde58a, _0x5d5b37, _0x5dad09, _0x46a986, _0x3741f7, _0x2a7d7b, _0x5f2d31, _0x5ac28a, _0x4345f6, _0x53279e, _0x524b2a, _0x5891c3, _0x55d382, _0x4bb978, _0x32061a, _0x3b0042, _0x564c09, _0x375bed, _0xf9ff83, _0x1a2bdf, _0x3071cf, _0x1dfc3d, _0x181262, _0x4ba7a3, _0x48454a, _0x126cf1, _0x4f1632, _0x299a20, _0x290e76, _0x54cb80, _0x3b1176, _0x15e67e, _0x511ab4, _0x270031, _0x5889f8, _0x193779, _0x424aa2, _0x5d9fd3, _0x636fab, _0x1f8482, _0x1e3eba, _0xecef33, _0x5411a5, _0x241e11, _0x498896, _0x37adfc, _0x1742d8, _0x523baa, _0x561d72, _0x4f3079, _0x517243, _0x49c504];
class _0x41e6fa {
  constructor(_0x477265) {
    this.index = ++_0x236070;
    this.name = this.index;
    this.valid = false;
    this.token = _0x477265;
    this.deviceId = "ykvgkzoyixnrrftwzwwxibnersiemhyjyqsamwptgr" + Math.floor(Date.now() / 1000).toString();
    this.taskList = [];
  }
  async getUserProfile() {
    try {
      let _0x2a4537 = "https://goldcoinnew.zhuishushenqi.com/account/profile?token=" + this.token + "&channel=APST&b-zssq=zssq",
        _0x4eaba3 = "",
        _0x8a91bd = _0x259ffa(_0x2a4537, this.deviceId, _0x4eaba3);
      await _0x7e4b4b("get", _0x8a91bd);
      let _0x35cbc7 = _0x119ac9;
      if (!_0x35cbc7) {
        return;
      }
      if (_0x35cbc7.ecode == 0) {
        this.valid = true;
        this.name = _0x35cbc7.data.nickname;
        this.gold = _0x35cbc7.data.gold;
        this.balance = _0x35cbc7.data.balance;
        console.log("昵称：" + this.name);
        console.log("余额：" + this.gold + "金币 ≈ " + this.balance + "元");
        console.log("等级：" + _0x35cbc7.data.level + " (经验 " + (_0x35cbc7.data.exp - _0x35cbc7.data.levelExp) + "/" + (_0x35cbc7.data.nextExp - _0x35cbc7.data.levelExp) + ")");
      } else {
        console.log("查询账户失败: " + _0x35cbc7.message);
      }
    } catch (_0x42acaf) {
      console.log(_0x42acaf);
    } finally {}
  }
  async judgeSignIn() {
    try {
      let _0x561265 = "https://api.zhuishushenqi.com/user/v2/judgeSignIn?isNew=true&token=" + this.token + "&b-zssq=zssq",
        _0x538158 = "",
        _0x271573 = _0x259ffa(_0x561265, this.deviceId, _0x538158);
      await _0x7e4b4b("get", _0x271573);
      let _0xc8fca7 = _0x119ac9;
      if (!_0xc8fca7) {
        return;
      }
      _0xc8fca7.ok == true ? (console.log("今天" + (_0xc8fca7.type == 0 ? "已" : "未") + "签到，已签到" + _0xc8fca7.days + "天"), _0xc8fca7.type && (await this.signIn(_0xc8fca7.activityId))) : console.log("查询签到情况失败: " + _0xc8fca7.code);
    } catch (_0x346d5e) {
      console.log(_0x346d5e);
    } finally {}
  }
  async signIn(_0x4268b6) {
    try {
      let _0x13ada8 = "https://api.zhuishushenqi.com/user/signIn?isNew=true&token=" + this.token + "&activityId=" + _0x4268b6 + "&version=2&type=2&b-zssq=zssq",
        _0x308b06 = "",
        _0x7e4257 = _0x259ffa(_0x13ada8, this.deviceId, _0x308b06);
      await _0x7e4b4b("get", _0x7e4257);
      let _0x1b9d26 = _0x119ac9;
      if (!_0x1b9d26) {
        return;
      }
      _0x1b9d26.ok == true ? console.log("签到成功，获得" + _0x1b9d26.gold + "金币") : console.log("签到失败: " + _0x1b9d26.code);
    } catch (_0x1bc4c7) {
      console.log(_0x1bc4c7);
    } finally {}
  }
  async getTaskList() {
    try {
      let _0x3b076e = "http://goldcoinnew.zhuishushenqi.com/redPacket/tasks?taskVersion=4001&token=" + this.token + "&version=4.45.0",
        _0x13b708 = "",
        _0x414433 = _0x259ffa(_0x3b076e, this.deviceId, _0x13b708);
      await _0x7e4b4b("get", _0x414433);
      let _0x454b0e = _0x119ac9;
      if (!_0x454b0e) {
        return;
      }
      if (_0x454b0e.ecode == 0) {
        for (let _0x323e88 of _0x454b0e.data) {
          console.log(_0x323e88.title + " " + _0x323e88.completed + "/" + _0x323e88.times + " -- " + (_0x323e88.taskStatus ? "已" : "未") + "完成");
          if (!_0x323e88.taskStatus) {
            if (!(_0x323e88.action == "rw-incentive-video")) {
              if (!(_0x323e88.action == "rw-purchase")) {
                if (!(_0x323e88.action == "rw-daily-question")) {
                  if (!(_0x323e88.action == "rw-total-read")) {
                    if (!(_0x323e88.action.indexOf("rw-read") > -1)) {
                      this.taskList.push(_0x323e88);
                    }
                  }
                }
              }
            }
          }
        }
      } else {
        console.log("查询任务列表失败: " + _0x454b0e.message);
      }
    } catch (_0x32bf8b) {
      console.log(_0x32bf8b);
    } finally {}
  }
  async completeTask(_0x24a8d7) {
    try {
      let _0x3a8340 = "goldTask";
      for (let _0xf85684 of _0x24a8d7.position) {
        _0x3a8340 = _0xf85684.position;
      }
      let _0x71606c = "http://goldcoinnew.zhuishushenqi.com/redPacket/completeTask?token=" + this.token,
        _0x4c8511 = "{\"version\":\"4.45.0\",\"action\":\"" + _0x24a8d7.action + "\",\"channel\":\"APST\",\"taskVersion\":" + _0x24a8d7.taskVersion + ",\"position\":\"" + _0x3a8340 + "\"}",
        _0x54be86 = _0x259ffa(_0x71606c, this.deviceId, _0x4c8511);
      await _0x7e4b4b("post", _0x54be86);
      let _0x5b6313 = _0x119ac9;
      if (!_0x5b6313) {
        return;
      }
      if (_0x5b6313.ecode == 0) {
        let _0x2255c5 = [];
        for (let _0x27b789 in _0x5b6313.data) {
          _0x2255c5.push(_0x5b6313.data[_0x27b789].rewardText);
        }
        console.log("完成任务[" + _0x24a8d7.title + "]获得" + _0x2255c5.join("，"));
      } else {
        console.log("完成任务[" + _0x24a8d7.title + "]失败: " + _0x5b6313.message);
      }
    } catch (_0x43fdd4) {
      console.log(_0x43fdd4);
    } finally {}
  }
  async incentiveVideo(_0x4fc135) {
    try {
      let _0x572928 = "http://goldcoinnew.zhuishushenqi.com/redPacket/incentiveVideo?token=" + this.token + "&b-zssq=" + _0x38c1b8.encode(this.deviceId),
        _0x45ad7f = "{\"data\":\"a7KlUX+09Sgkx3sPFPuHhoP9H5i02H9hjhuJhr7yY8ffaifx5FIhOIO\\/Wh67UR8s\\r\\nJwbWUjOPH6A2he82NF0ZpA==\",\"version\":\"4.45.0\",\"action\":\"" + _0x4fc135.action + "\",\"channel\":\"APST\",\"position\":\"\",\"taskVersion\":" + _0x4fc135.taskVersion + "}",
        _0x5aa892 = _0x259ffa(_0x572928, this.deviceId, _0x45ad7f);
      await _0x7e4b4b("post", _0x5aa892);
      let _0x210d23 = _0x119ac9;
      if (!_0x210d23) {
        return;
      }
      if (_0x210d23.ecode == 0) {
        let _0xd8cbb6 = [];
        for (let _0x194605 in _0x210d23.data) {
          _0xd8cbb6.push(_0x210d23.data[_0x194605].rewardText);
        }
        console.log("完成任务[" + _0x4fc135.title + "]获得" + _0xd8cbb6.join("，"));
      } else {
        console.log("完成任务[" + _0x4fc135.title + "]失败: " + _0x210d23.message);
      }
    } catch (_0x155b8b) {
      console.log(_0x155b8b);
    } finally {}
  }
  async getActiveRaffle() {
    try {
      let _0x46f7d0 = "https://goldcoin.zhuishushenqi.com/raffle/getActiveRaffle?token=" + this.token,
        _0x2a43bb = "",
        _0x52db96 = _0x259ffa(_0x46f7d0, this.deviceId, _0x2a43bb);
      await _0x7e4b4b("get", _0x52db96);
      let _0x5f3131 = _0x119ac9;
      if (!_0x5f3131) {
        return;
      }
      _0x5f3131.ok == true ? (this.raffleId = _0x5f3131.data.raffle._id, await this.doDraw()) : console.log("查询抽奖情况失败: " + _0x5f3131.message);
    } catch (_0x21a1a4) {
      console.log(_0x21a1a4);
    } finally {}
  }
  async doDraw() {
    try {
      let _0x3e0bd3 = "http://goldcoin.zhuishushenqi.com/raffle/doDraw",
        _0x5efcf1 = "{\"isGold\":true,\"raffleId\":\"" + this.raffleId + "\",\"token\":\"" + this.token + "\"}",
        _0x26da37 = _0x259ffa(_0x3e0bd3, this.deviceId, _0x5efcf1);
      await _0x7e4b4b("post", _0x26da37);
      let _0x1cac6e = _0x119ac9;
      if (!_0x1cac6e) {
        return;
      }
      _0x1cac6e.ok == true ? console.log("抽奖获得" + _0x1cac6e.data.prize.name) : console.log("抽奖失败: " + _0x1cac6e.message);
    } catch (_0x3e48f8) {
      console.log(_0x3e48f8);
    } finally {}
  }
  async getCountdownGold(_0x2b12cc) {
    try {
      let _0x39f6d8 = "https://goldcoin.zhuishushenqi.com/activity/getCountdownGold?token=" + this.token + "&adType=" + _0x2b12cc + "&b-zssq=zssq",
        _0x21fd73 = "",
        _0x2b9686 = _0x259ffa(_0x39f6d8, this.deviceId, _0x21fd73);
      await _0x7e4b4b("get", _0x2b9686);
      let _0x17e967 = _0x119ac9;
      if (!_0x17e967) {
        return;
      }
      if (_0x17e967.code == 0) {
        if (_0x17e967.data.status == 2) {
          console.log("可领取时段红包[" + _0x2b12cc + "]");
          await this.addCountDownGold(_0x2b12cc);
        } else {
          _0x17e967.data.status == 1 ? console.log("时段红包[" + _0x2b12cc + "]冷却中，下次领取时间: " + _0x17e967.data.nextTime) : console.log("今天时段红包[" + _0x2b12cc + "]次数已用完");
        }
      } else {
        console.log("查询时段红包[" + _0x2b12cc + "]失败: " + _0x17e967.msg);
      }
    } catch (_0x5280d1) {
      console.log(_0x5280d1);
    } finally {}
  }
  async addCountDownGold(_0x559dfc) {
    try {
      let _0x2cef7e = "https://goldcoin.zhuishushenqi.com/activity/addCountDownGold?b-zssq=zssq",
        _0x6e4dcf = "token=" + this.token + "&adType=" + _0x559dfc,
        _0x50d1a9 = _0x259ffa(_0x2cef7e, this.deviceId, _0x6e4dcf);
      _0x50d1a9.headers["Content-Type"] = "application/x-www-form-urlencoded";
      await _0x7e4b4b("post", _0x50d1a9);
      let _0x42ea03 = _0x119ac9;
      if (!_0x42ea03) {
        return;
      }
      if (_0x42ea03.code == 0) {
        console.log("领取时段红包[" + _0x559dfc + "]获得" + _0x42ea03.data.gold + "金币");
        _0x42ea03?.["data"]?.["videoId"];
      } else {
        console.log("领取时段红包[" + _0x559dfc + "]失败: " + _0x42ea03.msg);
      }
    } catch (_0x24ed6c) {
      console.log(_0x24ed6c);
    } finally {}
  }
  async addCountdownVideoGold(_0xee45f6, _0x132bb8) {
    try {
      let _0x2c5acf = "http://goldcoin.zhuishushenqi.com/activity/addCountdownVideoGold",
        _0x5d94b8 = "{\"token\":\"" + this.token + "\",\"adType\":\"" + _0xee45f6 + "\",\"data\":\"a7KlUX%2B09Sgkx3sPFPuHhoP9H5i02H9hjhuJhr7yY8ffaifx5FIhOIO%2FWh67UR8s%0D%0AUJqW9ALUMqrGbS8g4VeS4Q%3D%3D\",\"videoId\":\"" + _0x132bb8 + "\",\"deviceId\":\"" + this.deviceId + "\"}",
        _0xbe3b54 = _0x259ffa(_0x2c5acf, this.deviceId, _0x5d94b8);
      await _0x7e4b4b("post", _0xbe3b54);
      let _0x216df5 = _0x119ac9;
      if (!_0x216df5) {
        return;
      }
      _0x216df5.code == 0 ? console.log("领取时段红包[" + _0xee45f6 + "]翻倍视频奖励获得" + _0x216df5.data.gold + "金币") : console.log("领取时段红包[" + _0xee45f6 + "]翻倍视频奖励失败: " + _0x216df5.msg);
    } catch (_0x14de2c) {
      console.log(_0x14de2c);
    } finally {}
  }
  async dailyQuesDistribution() {
    try {
      let _0x2082b2 = "https://activitynew.zhuishushenqi.com/activity/dailyQuestion/distribution",
        _0x481e54 = "{\"action\":\"rw-daily-question\",\"appName\":\"iosMaster\",\"platform\":\"ios\",\"position\":\"goldTask\",\"taskVersion\":4001,\"token\":\"" + this.token + "\",\"version\":\"4.45.0\"}",
        _0x1dd0ad = _0x259ffa(_0x2082b2, this.deviceId, _0x481e54);
      await _0x7e4b4b("post", _0x1dd0ad);
      let _0x1eed50 = _0x119ac9;
      if (!_0x1eed50) {
        return;
      }
      if (_0x1eed50.ecode == 0) {
        console.log("每日趣味问答进度：" + _0x1eed50.data.finished + "/" + _0x1eed50.data.count);
        if (_0x1eed50.data.finished < _0x1eed50.data.count) {
          for (let _0x22aa8c of _0x1eed50.data.questions) {
            if (_0x22aa8c.isFinished == false) {
              await _0x558f42.wait(2000);
              console.log("\n回答问题：" + _0x22aa8c.title);
              await this.dailyQuesAnswer(_0x22aa8c);
            } else {
              console.log("\n已回答的问题：" + _0x22aa8c.title);
              for (let _0x305fc5 in _0x22aa8c.options) {
                console.log(parseInt(_0x305fc5) + 1 + ": " + _0x22aa8c.options[_0x305fc5]);
              }
              console.log("你的答案：" + _0x22aa8c.options[_0x22aa8c.answer[0] - 1]);
              console.log("正确答案：" + _0x22aa8c.options[_0x22aa8c.rightAnswer[0] - 1]);
            }
          }
        }
      } else {
        console.log("获取每日趣味问答题目失败: " + _0x1eed50.message);
      }
    } catch (_0x56726b) {
      console.log(_0x56726b);
    } finally {}
  }
  async dailyQuesAnswer(_0x148a94) {
    try {
      for (let _0x4ee99c in _0x148a94.options) {
        console.log(parseInt(_0x4ee99c) + 1 + ": " + _0x148a94.options[_0x4ee99c]);
      }
      let _0x25e3dc = _0x3004c4(_0x148a94);
      console.log("选择回答: " + _0x148a94.options[_0x25e3dc]);
      let _0x416cb7 = "https://activitynew.zhuishushenqi.com/activity/dailyQuestion/handle",
        _0x21baaf = "{\"action\":\"rw-daily-question\",\"answers\":[{\"_id\":\"" + _0x148a94._id + "\",\"answer\":[" + (_0x25e3dc + 1) + "]}],\"appName\":\"iosMaster\",\"platform\":\"ios\",\"position\":\"goldTask\",\"taskVersion\":4001,\"token\":\"" + this.token + "\",\"version\":\"4.45.0\",\"extData\":\"\"}",
        _0x7a19dc = _0x259ffa(_0x416cb7, this.deviceId, _0x21baaf);
      await _0x7e4b4b("post", _0x7a19dc);
      let _0x3aea9a = _0x119ac9;
      if (!_0x3aea9a) {
        return;
      }
      if (_0x3aea9a.ecode == 0) {
        for (let _0x1555dc of _0x3aea9a.data) {
          let _0x3e8cb0 = "回答" + (_0x1555dc.isCorrect ? "正确" : "错误") + "，获得" + _0x1555dc.rewardExp + "经验，" + _0x1555dc.rewardGold + "金币";
          if (!_0x1555dc.isCorrect) {
            _0x3e8cb0 += "\n正确答案是：" + _0x148a94.options[_0x1555dc.rightAnswer[0] - 1];
          }
          console.log(_0x3e8cb0);
        }
      } else {
        console.log("回答题目失败: " + _0x3aea9a.message);
      }
    } catch (_0x2ac09e) {
      console.log(_0x2ac09e);
    } finally {}
  }
  async withdrawList() {
    try {
      let _0x5ddba4 = "https://convert.zhuishushenqi.com/convert/level?token=" + this.token,
        _0x3d4e11 = "",
        _0x515840 = _0x259ffa(_0x5ddba4, this.deviceId, _0x3d4e11);
      await _0x7e4b4b("get", _0x515840);
      let _0x32d23c = _0x119ac9;
      if (!_0x32d23c) {
        return;
      }
      if (_0x32d23c.ecode == 0) {
        for (let _0x177cb2 of _0x32d23c.data.sort(function (_0x2bb7cf, _0xd0f76e) {
          return _0xd0f76e.currency - _0x2bb7cf.currency;
        })) {
          if (_0x177cb2.levelStatus == "reach" && _0x177cb2.convertStatus == "unDraw") {
            await this.withdraw(_0x177cb2);
            let _0x1825c6 = Math.floor(Math.random() * 5000) + 5000;
            await _0x558f42.wait(_0x1825c6);
          }
        }
      } else {
        console.log("获取提现列表失败: " + _0x32d23c.message);
      }
    } catch (_0x1cc876) {
      console.log(_0x1cc876);
    } finally {}
  }
  async withdraw(_0x5e8836) {
    try {
      let _0x19b803 = "https://convert.zhuishushenqi.com/convert/withdraw",
        _0x22dacc = "{\"sm\":\"\",\"packageName\":\"com.ifmoc.ZhuiShuShenQi\",\"appName\":\"iosMaster\",\"token\":\"" + this.token + "\",\"level\":" + _0x5e8836.level + ",\"withdrawType\":\"cpt_weixin\",\"extData\":\"{\\\"$app_version\\\":\\\"4.45.0\\\",\\\"channel_name\\\":\\\"APST\\\",\\\"red_strategy_number\\\":\\\"13\\\",\\\"graytest_mark\\\":\\\"4.45.0\\\",\\\"user_ad_strategypositionId\\\":312,\\\"device_imei\\\":\\\"" + this.deviceId + "\\\",\\\"channel_id\\\":\\\"100013259\\\",\\\"red_user_current_level\\\":3,\\\"product_line\\\":\\\"1\\\",\\\"ua_channel_id\\\":\\\"100013259\\\",\\\"ua_channel_name\\\":\\\"APST\\\",\\\"is_vip\\\":false,\\\"new_user_welfare\\\":0,\\\"platform\\\":\\\"1\\\",\\\"red_user_getmoney_initial_level\\\":1,\\\"zs_login_id\\\":\\\"" + _0x558f42.randomString(24) + "\\\",\\\"idfa\\\":\\\"" + this.deviceId + "\\\",\\\"pub_app_first_install_time\\\":\\\"2022-04-14 21:04:13\\\"}\"}",
        _0x1378f4 = _0x259ffa(_0x19b803, this.deviceId, _0x22dacc);
      _0x1378f4.headers["Content-Type"] = "application/json;charset=utf-8";
      await _0x7e4b4b("post", _0x1378f4);
      let _0xba895 = _0x119ac9;
      if (!_0xba895) {
        return;
      }
      _0xba895.ecode == 0 ? console.log("提现" + _0xba895.currency / 100 + "元成功") : console.log("提现失败: " + _0xba895.message);
    } catch (_0x3de677) {
      console.log(_0x3de677);
    } finally {}
  }
  async userTask() {
    console.log("\n============= 账号[" + this.index + "] =============");
    await this.getUserProfile();
    if (!this.valid) {
      return;
    }
    await this.judgeSignIn();
    await this.getCountdownGold("welfare");
    await this.getTaskList();
    for (let _0x1ff68a of this.taskList) {
      await this.completeTask(_0x1ff68a);
    }
    await this.dailyQuesDistribution();
    await this.withdrawList();
  }
}
!(async () => {
  if (typeof $request !== "undefined") {
    await _0x253ae0();
  } else {
    await _0x354e90();
    if (_0x3550c7 == false) {
      return;
    }
    if (!(await _0x3c571f())) {
      return;
    }
    for (let _0x573e48 of _0x9d0e2a) {
      await _0x573e48.userTask();
    }
  }
})().catch(_0x15f9a5 => console.log(_0x15f9a5)).finally(() => _0x558f42.done());
async function _0x253ae0() {
  if ($request.url.indexOf("goldcoinnew.zhuishushenqi.com/account/profile") > -1) {
    let _0x58154a = $request.url.match(/token=([\w\-]+)/)[1];
    _0x5461b7 ? _0x5461b7.indexOf(_0x58154a) == -1 && (_0x5461b7 = _0x5461b7 + "\n" + _0x58154a, _0x558f42.setdata(_0x5461b7, "zssqCookie"), ckList = _0x5461b7.split("\n"), _0x558f42.msg("获取第" + ckList.length + "个ck成功: " + _0x58154a)) : (_0x558f42.setdata(_0x58154a, "zssqCookie"), _0x558f42.msg("获取第1个ck成功: " + _0x58154a));
  }
}
async function _0x3c571f() {
  if (_0x5461b7) {
    let _0x228952 = _0x24dbb3[0];
    for (let _0x46f1ba of _0x24dbb3) {
      if (_0x5461b7.indexOf(_0x46f1ba) > -1) {
        _0x228952 = _0x46f1ba;
        break;
      }
    }
    for (let _0xed6d60 of _0x5461b7.split(_0x228952)) {
      if (_0xed6d60) {
        _0x9d0e2a.push(new _0x41e6fa(_0xed6d60));
      }
    }
    _0x14715b = _0x9d0e2a.length;
  } else {
    console.log("未找到CK");
    return;
  }
  console.log("共找到" + _0x14715b + "个账号");
  return true;
}
function _0x3004c4(_0x4c5ce4) {
  let _0x5139f1 = 1;
  try {
    let _0xe6fed = false;
    for (let _0x2173fb of _0x11f033) {
      if (_0x4c5ce4.title.indexOf(_0x2173fb.keys) == -1) {
        continue;
      }
      _0xe6fed = true;
      for (let _0x48a4a1 in _0x4c5ce4.options) {
        if (_0x4c5ce4.options[_0x48a4a1].indexOf(_0x2173fb.answer) > -1) {
          console.log("匹配到答案");
          _0x5139f1 = parseInt(_0x48a4a1);
          break;
        }
      }
      break;
    }
    !_0xe6fed && (console.log("没有匹配到答案，选择随机答案"), _0x5139f1 = Math.floor(Math.random() * _0x4c5ce4.options.length));
  } catch (_0x104ee6) {
    console.log(_0x104ee6);
  } finally {
    return _0x5139f1;
  }
}
async function _0x354e90(_0x1abe43 = 0) {
  let _0x3e1a9e = {
    url: _0x5d915e
  };
  await _0x7e4b4b("get", _0x3e1a9e);
  let _0x4b5700 = _0x119ac9;
  if (!_0x4b5700) {
    if (_0x1abe43 < _0x1e4b84) {
      await _0x354e90(++_0x1abe43);
    }
    return;
  }
  _0x4b5700?.["code"] == 0 && (_0x4b5700 = JSON.parse(_0x4b5700.data.file.data));
  _0x4b5700?.["commonNotify"] && _0x4b5700.commonNotify.length > 0 && _0x558f42.logAndNotify(_0x4b5700.commonNotify.join("\n") + "\n");
  _0x4b5700?.["commonMsg"] && _0x4b5700.commonMsg.length > 0 && console.log(_0x4b5700.commonMsg.join("\n") + "\n");
  if (_0x4b5700[_0x548e5e]) {
    let _0x6c3a03 = _0x4b5700[_0x548e5e];
    _0x6c3a03.status == 0 ? _0x36d8c0 >= _0x6c3a03.version ? (_0x3550c7 = true, console.log(_0x6c3a03.msg[_0x6c3a03.status]), console.log(_0x6c3a03.updateMsg), console.log("现在运行的脚本版本是：" + _0x36d8c0 + "，最新脚本版本：" + _0x6c3a03.latestVersion)) : console.log(_0x6c3a03.versionMsg) : console.log(_0x6c3a03.msg[_0x6c3a03.status]);
  } else {
    console.log(_0x4b5700.errorMsg);
  }
}
function _0x259ffa(_0x47edb3, _0x39beeb, _0x152c49 = "") {
  let _0x4625bd = _0x47edb3.replace("//", "/").split("/")[1];
  const _0x443601 = {
    Host: _0x4625bd,
    Connection: "keep-alive",
    "User-Agent": "Mozilla/5.0 (iPhone; CPU iPhone OS 15_0 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Mobile/15E148 /sa-sdk-ios/sensors-verify/endpoint.zhuishushenqi.com?production ",
    "X-Device-Id": _0x39beeb
  };
  let _0x928b52 = {
    url: _0x47edb3,
    headers: _0x443601,
    timeout: 5000
  };
  _0x152c49 && (_0x928b52.body = _0x152c49, _0x928b52.headers["Content-Type"] = "application/json", _0x928b52.headers["Content-Length"] = _0x928b52.body ? _0x928b52.body.length : 0);
  return _0x928b52;
}
async function _0x7e4b4b(_0x194f92, _0x134863) {
  _0x119ac9 = null;
  _0x3c719b = null;
  _0x34adbb = null;
  return new Promise(_0x615b0 => {
    _0x558f42.send(_0x194f92, _0x134863, async (_0x5c0f63, _0x59018d, _0x470889) => {
      try {
        _0x3c719b = _0x59018d;
        _0x34adbb = _0x470889;
        if (_0x5c0f63) {
          console.log(_0x194f92 + "请求失败");
          console.log(JSON.stringify(_0x5c0f63));
        } else {
          if (_0x470889.body) {
            if (typeof _0x470889.body == "object") {
              _0x119ac9 = _0x470889.body;
            } else {
              try {
                _0x119ac9 = JSON.parse(_0x470889.body);
              } catch (_0x3bfa37) {
                _0x119ac9 = _0x470889.body;
              }
            }
          }
        }
      } catch (_0x1738cb) {
        console.log(_0x1738cb);
      } finally {
        _0x615b0();
      }
    });
  });
}
function _0x1f63a2(_0x39a712, _0x18b431, _0x3a22d2, _0x53f95a, _0x45fe44, _0x236936) {
  return CryptoJS[_0x39a712].encrypt(CryptoJS.enc.Utf8.parse(_0x53f95a), CryptoJS.enc.Utf8.parse(_0x45fe44), {
    mode: CryptoJS.mode[_0x18b431],
    padding: CryptoJS.pad[_0x3a22d2],
    iv: CryptoJS.enc.Utf8.parse(_0x236936)
  }).ciphertext.toString(CryptoJS.enc.Base64);
}
function _0x595194(_0x346e2b, _0x1c5260, _0x1ef158, _0x542835, _0x5ebbdd, _0x4962b3) {
  return CryptoJS[_0x346e2b].decrypt({
    ciphertext: CryptoJS.enc.Base64.parse(_0x542835)
  }, CryptoJS.enc.Utf8.parse(_0x5ebbdd), {
    mode: CryptoJS.mode[_0x1c5260],
    padding: CryptoJS.pad[_0x1ef158],
    iv: CryptoJS.enc.Utf8.parse(_0x4962b3)
  }).toString(CryptoJS.enc.Utf8);
}
var _0x38c1b8 = {
  _keyStr: "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=",
  encode: function (_0x315a64) {
    var _0x418f7b = "";
    var _0x7b7d93, _0xfd99b1, _0x24b074, _0x1f7d01, _0x1c2fc8, _0x58ba73, _0x2890df;
    var _0x31ec1b = 0;
    _0x315a64 = _0x38c1b8._utf8_encode(_0x315a64);
    while (_0x31ec1b < _0x315a64.length) {
      _0x7b7d93 = _0x315a64.charCodeAt(_0x31ec1b++);
      _0xfd99b1 = _0x315a64.charCodeAt(_0x31ec1b++);
      _0x24b074 = _0x315a64.charCodeAt(_0x31ec1b++);
      _0x1f7d01 = _0x7b7d93 >> 2;
      _0x1c2fc8 = (_0x7b7d93 & 3) << 4 | _0xfd99b1 >> 4;
      _0x58ba73 = (_0xfd99b1 & 15) << 2 | _0x24b074 >> 6;
      _0x2890df = _0x24b074 & 63;
      if (isNaN(_0xfd99b1)) {
        _0x58ba73 = _0x2890df = 64;
      } else {
        isNaN(_0x24b074) && (_0x2890df = 64);
      }
      _0x418f7b = _0x418f7b + this._keyStr.charAt(_0x1f7d01) + this._keyStr.charAt(_0x1c2fc8) + this._keyStr.charAt(_0x58ba73) + this._keyStr.charAt(_0x2890df);
    }
    return _0x418f7b;
  },
  decode: function (_0x53d03b) {
    var _0x131b11 = "",
      _0x3417c0,
      _0x5f3a2e,
      _0x134364,
      _0x12f019,
      _0x593924,
      _0xf2668f,
      _0x3ce495,
      _0xfb0c82 = 0;
    _0x53d03b = _0x53d03b.replace(/[^A-Za-z0-9+/=]/g, "");
    while (_0xfb0c82 < _0x53d03b.length) {
      _0x12f019 = this._keyStr.indexOf(_0x53d03b.charAt(_0xfb0c82++));
      _0x593924 = this._keyStr.indexOf(_0x53d03b.charAt(_0xfb0c82++));
      _0xf2668f = this._keyStr.indexOf(_0x53d03b.charAt(_0xfb0c82++));
      _0x3ce495 = this._keyStr.indexOf(_0x53d03b.charAt(_0xfb0c82++));
      _0x3417c0 = _0x12f019 << 2 | _0x593924 >> 4;
      _0x5f3a2e = (_0x593924 & 15) << 4 | _0xf2668f >> 2;
      _0x134364 = (_0xf2668f & 3) << 6 | _0x3ce495;
      _0x131b11 = _0x131b11 + String.fromCharCode(_0x3417c0);
      _0xf2668f != 64 && (_0x131b11 = _0x131b11 + String.fromCharCode(_0x5f3a2e));
      _0x3ce495 != 64 && (_0x131b11 = _0x131b11 + String.fromCharCode(_0x134364));
    }
    _0x131b11 = _0x38c1b8._utf8_decode(_0x131b11);
    return _0x131b11;
  },
  _utf8_encode: function (_0x181ff2) {
    _0x181ff2 = _0x181ff2.replace(/rn/g, "n");
    var _0xdd32cf = "";
    for (var _0x1c66d6 = 0; _0x1c66d6 < _0x181ff2.length; _0x1c66d6++) {
      var _0x5106ed = _0x181ff2.charCodeAt(_0x1c66d6);
      if (_0x5106ed < 128) {
        _0xdd32cf += String.fromCharCode(_0x5106ed);
      } else {
        _0x5106ed > 127 && _0x5106ed < 2048 ? (_0xdd32cf += String.fromCharCode(_0x5106ed >> 6 | 192), _0xdd32cf += String.fromCharCode(_0x5106ed & 63 | 128)) : (_0xdd32cf += String.fromCharCode(_0x5106ed >> 12 | 224), _0xdd32cf += String.fromCharCode(_0x5106ed >> 6 & 63 | 128), _0xdd32cf += String.fromCharCode(_0x5106ed & 63 | 128));
      }
    }
    return _0xdd32cf;
  },
  _utf8_decode: function (_0x163597) {
    var _0x438928 = "";
    var _0x5bab66 = 0;
    c1 = c2 = 0;
    var _0x5dcd30 = c1;
    while (_0x5bab66 < _0x163597.length) {
      _0x5dcd30 = _0x163597.charCodeAt(_0x5bab66);
      if (_0x5dcd30 < 128) {
        _0x438928 += String.fromCharCode(_0x5dcd30);
        _0x5bab66++;
      } else {
        _0x5dcd30 > 191 && _0x5dcd30 < 224 ? (c2 = _0x163597.charCodeAt(_0x5bab66 + 1), _0x438928 += String.fromCharCode((_0x5dcd30 & 31) << 6 | c2 & 63), _0x5bab66 += 2) : (c2 = _0x163597.charCodeAt(_0x5bab66 + 1), c3 = _0x163597.charCodeAt(_0x5bab66 + 2), _0x438928 += String.fromCharCode((_0x5dcd30 & 15) << 12 | (c2 & 63) << 6 | c3 & 63), _0x5bab66 += 3);
      }
    }
    return _0x438928;
  }
};
function _0x313165(_0x3ae4f4) {
  function _0x9bbf86(_0x446b18, _0x40af8d) {
    return _0x446b18 << _0x40af8d | _0x446b18 >>> 32 - _0x40af8d;
  }
  function _0x32667f(_0xc1b624, _0x4aca67) {
    var _0x11a2a9, _0x17cdc7, _0x5220db, _0x40cec6, _0xf0cce2;
    _0x5220db = 2147483648 & _0xc1b624;
    _0x40cec6 = 2147483648 & _0x4aca67;
    _0x11a2a9 = 1073741824 & _0xc1b624;
    _0x17cdc7 = 1073741824 & _0x4aca67;
    _0xf0cce2 = (1073741823 & _0xc1b624) + (1073741823 & _0x4aca67);
    return _0x11a2a9 & _0x17cdc7 ? 2147483648 ^ _0xf0cce2 ^ _0x5220db ^ _0x40cec6 : _0x11a2a9 | _0x17cdc7 ? 1073741824 & _0xf0cce2 ? 3221225472 ^ _0xf0cce2 ^ _0x5220db ^ _0x40cec6 : 1073741824 ^ _0xf0cce2 ^ _0x5220db ^ _0x40cec6 : _0xf0cce2 ^ _0x5220db ^ _0x40cec6;
  }
  function _0x57020f(_0x4123d8, _0x23e2af, _0x5e9559) {
    return _0x4123d8 & _0x23e2af | ~_0x4123d8 & _0x5e9559;
  }
  function _0x16de89(_0x4dba6a, _0x222e16, _0x117dee) {
    return _0x4dba6a & _0x117dee | _0x222e16 & ~_0x117dee;
  }
  function _0x227bcd(_0x1dd255, _0xdd2008, _0x6f93db) {
    return _0x1dd255 ^ _0xdd2008 ^ _0x6f93db;
  }
  function _0x1765ff(_0x4219d2, _0x48df2c, _0x5e1216) {
    return _0x48df2c ^ (_0x4219d2 | ~_0x5e1216);
  }
  function _0x50a652(_0x1ae3bd, _0x29fc98, _0x9d7b6d, _0x4701ea, _0x52a33a, _0x7b4f30, _0x11d07b) {
    _0x1ae3bd = _0x32667f(_0x1ae3bd, _0x32667f(_0x32667f(_0x57020f(_0x29fc98, _0x9d7b6d, _0x4701ea), _0x52a33a), _0x11d07b));
    return _0x32667f(_0x9bbf86(_0x1ae3bd, _0x7b4f30), _0x29fc98);
  }
  function _0x126642(_0x328502, _0x21306f, _0x23bbda, _0x59ff0d, _0x51758c, _0x40cb83, _0x54b9d8) {
    _0x328502 = _0x32667f(_0x328502, _0x32667f(_0x32667f(_0x16de89(_0x21306f, _0x23bbda, _0x59ff0d), _0x51758c), _0x54b9d8));
    return _0x32667f(_0x9bbf86(_0x328502, _0x40cb83), _0x21306f);
  }
  function _0xdf82b3(_0x37da8b, _0x3200e1, _0x518236, _0xf9e991, _0x537fa7, _0x2ac17a, _0x22a825) {
    _0x37da8b = _0x32667f(_0x37da8b, _0x32667f(_0x32667f(_0x227bcd(_0x3200e1, _0x518236, _0xf9e991), _0x537fa7), _0x22a825));
    return _0x32667f(_0x9bbf86(_0x37da8b, _0x2ac17a), _0x3200e1);
  }
  function _0x198de5(_0x25639f, _0x5afe6f, _0x14ae61, _0x251c08, _0x5f5826, _0x1e97d9, _0x1b3991) {
    _0x25639f = _0x32667f(_0x25639f, _0x32667f(_0x32667f(_0x1765ff(_0x5afe6f, _0x14ae61, _0x251c08), _0x5f5826), _0x1b3991));
    return _0x32667f(_0x9bbf86(_0x25639f, _0x1e97d9), _0x5afe6f);
  }
  function _0x3d814b(_0x35307f) {
    for (var _0xf74b80, _0x2388d5 = _0x35307f.length, _0x16cc38 = _0x2388d5 + 8, _0x3fd8b3 = (_0x16cc38 - _0x16cc38 % 64) / 64, _0x4b5939 = 16 * (_0x3fd8b3 + 1), _0x319858 = new Array(_0x4b5939 - 1), _0x17f3a7 = 0, _0x57854a = 0; _0x2388d5 > _0x57854a;) {
      _0xf74b80 = (_0x57854a - _0x57854a % 4) / 4;
      _0x17f3a7 = _0x57854a % 4 * 8;
      _0x319858[_0xf74b80] = _0x319858[_0xf74b80] | _0x35307f.charCodeAt(_0x57854a) << _0x17f3a7;
      _0x57854a++;
    }
    _0xf74b80 = (_0x57854a - _0x57854a % 4) / 4;
    _0x17f3a7 = _0x57854a % 4 * 8;
    _0x319858[_0xf74b80] = _0x319858[_0xf74b80] | 128 << _0x17f3a7;
    _0x319858[_0x4b5939 - 2] = _0x2388d5 << 3;
    _0x319858[_0x4b5939 - 1] = _0x2388d5 >>> 29;
    return _0x319858;
  }
  function _0x15f15a(_0x17c4e4) {
    var _0x32636c,
      _0x35d57a,
      _0x1b6efc = "",
      _0x13a998 = "";
    for (_0x35d57a = 0; 3 >= _0x35d57a; _0x35d57a++) {
      _0x32636c = _0x17c4e4 >>> 8 * _0x35d57a & 255;
      _0x13a998 = "0" + _0x32636c.toString(16);
      _0x1b6efc += _0x13a998.substr(_0x13a998.length - 2, 2);
    }
    return _0x1b6efc;
  }
  function _0x40f129(_0x3620ee) {
    _0x3620ee = _0x3620ee.replace(/\r\n/g, "\n");
    for (var _0xd764b0 = "", _0x34140a = 0; _0x34140a < _0x3620ee.length; _0x34140a++) {
      var _0x419e46 = _0x3620ee.charCodeAt(_0x34140a);
      128 > _0x419e46 ? _0xd764b0 += String.fromCharCode(_0x419e46) : _0x419e46 > 127 && 2048 > _0x419e46 ? (_0xd764b0 += String.fromCharCode(_0x419e46 >> 6 | 192), _0xd764b0 += String.fromCharCode(63 & _0x419e46 | 128)) : (_0xd764b0 += String.fromCharCode(_0x419e46 >> 12 | 224), _0xd764b0 += String.fromCharCode(_0x419e46 >> 6 & 63 | 128), _0xd764b0 += String.fromCharCode(63 & _0x419e46 | 128));
    }
    return _0xd764b0;
  }
  var _0x5400e2,
    _0x31fb51,
    _0x444374,
    _0x134dc2,
    _0x417851,
    _0x1a6e16,
    _0x32a687,
    _0x8c2949,
    _0x2c4707,
    _0x2281ad = [],
    _0x58c062 = 7,
    _0x396b17 = 12,
    _0x3c0a04 = 17,
    _0x1a9773 = 22,
    _0x465299 = 5,
    _0x287488 = 9,
    _0x53077c = 14,
    _0x4c1238 = 20,
    _0x1d0a42 = 4,
    _0x4c67e0 = 11,
    _0x14aa3f = 16,
    _0x62f6b4 = 23,
    _0x1a45f1 = 6,
    _0x1c4d29 = 10,
    _0x4837ec = 15,
    _0x14e4b9 = 21;
  for (_0x3ae4f4 = _0x40f129(_0x3ae4f4), _0x2281ad = _0x3d814b(_0x3ae4f4), _0x1a6e16 = 1732584193, _0x32a687 = 4023233417, _0x8c2949 = 2562383102, _0x2c4707 = 271733878, _0x5400e2 = 0; _0x5400e2 < _0x2281ad.length; _0x5400e2 += 16) {
    _0x31fb51 = _0x1a6e16;
    _0x444374 = _0x32a687;
    _0x134dc2 = _0x8c2949;
    _0x417851 = _0x2c4707;
    _0x1a6e16 = _0x50a652(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 0], _0x58c062, 3614090360);
    _0x2c4707 = _0x50a652(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 1], _0x396b17, 3905402710);
    _0x8c2949 = _0x50a652(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 2], _0x3c0a04, 606105819);
    _0x32a687 = _0x50a652(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 3], _0x1a9773, 3250441966);
    _0x1a6e16 = _0x50a652(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 4], _0x58c062, 4118548399);
    _0x2c4707 = _0x50a652(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 5], _0x396b17, 1200080426);
    _0x8c2949 = _0x50a652(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 6], _0x3c0a04, 2821735955);
    _0x32a687 = _0x50a652(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 7], _0x1a9773, 4249261313);
    _0x1a6e16 = _0x50a652(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 8], _0x58c062, 1770035416);
    _0x2c4707 = _0x50a652(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 9], _0x396b17, 2336552879);
    _0x8c2949 = _0x50a652(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 10], _0x3c0a04, 4294925233);
    _0x32a687 = _0x50a652(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 11], _0x1a9773, 2304563134);
    _0x1a6e16 = _0x50a652(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 12], _0x58c062, 1804603682);
    _0x2c4707 = _0x50a652(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 13], _0x396b17, 4254626195);
    _0x8c2949 = _0x50a652(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 14], _0x3c0a04, 2792965006);
    _0x32a687 = _0x50a652(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 15], _0x1a9773, 1236535329);
    _0x1a6e16 = _0x126642(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 1], _0x465299, 4129170786);
    _0x2c4707 = _0x126642(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 6], _0x287488, 3225465664);
    _0x8c2949 = _0x126642(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 11], _0x53077c, 643717713);
    _0x32a687 = _0x126642(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 0], _0x4c1238, 3921069994);
    _0x1a6e16 = _0x126642(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 5], _0x465299, 3593408605);
    _0x2c4707 = _0x126642(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 10], _0x287488, 38016083);
    _0x8c2949 = _0x126642(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 15], _0x53077c, 3634488961);
    _0x32a687 = _0x126642(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 4], _0x4c1238, 3889429448);
    _0x1a6e16 = _0x126642(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 9], _0x465299, 568446438);
    _0x2c4707 = _0x126642(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 14], _0x287488, 3275163606);
    _0x8c2949 = _0x126642(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 3], _0x53077c, 4107603335);
    _0x32a687 = _0x126642(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 8], _0x4c1238, 1163531501);
    _0x1a6e16 = _0x126642(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 13], _0x465299, 2850285829);
    _0x2c4707 = _0x126642(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 2], _0x287488, 4243563512);
    _0x8c2949 = _0x126642(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 7], _0x53077c, 1735328473);
    _0x32a687 = _0x126642(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 12], _0x4c1238, 2368359562);
    _0x1a6e16 = _0xdf82b3(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 5], _0x1d0a42, 4294588738);
    _0x2c4707 = _0xdf82b3(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 8], _0x4c67e0, 2272392833);
    _0x8c2949 = _0xdf82b3(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 11], _0x14aa3f, 1839030562);
    _0x32a687 = _0xdf82b3(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 14], _0x62f6b4, 4259657740);
    _0x1a6e16 = _0xdf82b3(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 1], _0x1d0a42, 2763975236);
    _0x2c4707 = _0xdf82b3(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 4], _0x4c67e0, 1272893353);
    _0x8c2949 = _0xdf82b3(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 7], _0x14aa3f, 4139469664);
    _0x32a687 = _0xdf82b3(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 10], _0x62f6b4, 3200236656);
    _0x1a6e16 = _0xdf82b3(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 13], _0x1d0a42, 681279174);
    _0x2c4707 = _0xdf82b3(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 0], _0x4c67e0, 3936430074);
    _0x8c2949 = _0xdf82b3(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 3], _0x14aa3f, 3572445317);
    _0x32a687 = _0xdf82b3(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 6], _0x62f6b4, 76029189);
    _0x1a6e16 = _0xdf82b3(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 9], _0x1d0a42, 3654602809);
    _0x2c4707 = _0xdf82b3(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 12], _0x4c67e0, 3873151461);
    _0x8c2949 = _0xdf82b3(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 15], _0x14aa3f, 530742520);
    _0x32a687 = _0xdf82b3(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 2], _0x62f6b4, 3299628645);
    _0x1a6e16 = _0x198de5(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 0], _0x1a45f1, 4096336452);
    _0x2c4707 = _0x198de5(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 7], _0x1c4d29, 1126891415);
    _0x8c2949 = _0x198de5(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 14], _0x4837ec, 2878612391);
    _0x32a687 = _0x198de5(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 5], _0x14e4b9, 4237533241);
    _0x1a6e16 = _0x198de5(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 12], _0x1a45f1, 1700485571);
    _0x2c4707 = _0x198de5(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 3], _0x1c4d29, 2399980690);
    _0x8c2949 = _0x198de5(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 10], _0x4837ec, 4293915773);
    _0x32a687 = _0x198de5(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 1], _0x14e4b9, 2240044497);
    _0x1a6e16 = _0x198de5(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 8], _0x1a45f1, 1873313359);
    _0x2c4707 = _0x198de5(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 15], _0x1c4d29, 4264355552);
    _0x8c2949 = _0x198de5(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 6], _0x4837ec, 2734768916);
    _0x32a687 = _0x198de5(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 13], _0x14e4b9, 1309151649);
    _0x1a6e16 = _0x198de5(_0x1a6e16, _0x32a687, _0x8c2949, _0x2c4707, _0x2281ad[_0x5400e2 + 4], _0x1a45f1, 4149444226);
    _0x2c4707 = _0x198de5(_0x2c4707, _0x1a6e16, _0x32a687, _0x8c2949, _0x2281ad[_0x5400e2 + 11], _0x1c4d29, 3174756917);
    _0x8c2949 = _0x198de5(_0x8c2949, _0x2c4707, _0x1a6e16, _0x32a687, _0x2281ad[_0x5400e2 + 2], _0x4837ec, 718787259);
    _0x32a687 = _0x198de5(_0x32a687, _0x8c2949, _0x2c4707, _0x1a6e16, _0x2281ad[_0x5400e2 + 9], _0x14e4b9, 3951481745);
    _0x1a6e16 = _0x32667f(_0x1a6e16, _0x31fb51);
    _0x32a687 = _0x32667f(_0x32a687, _0x444374);
    _0x8c2949 = _0x32667f(_0x8c2949, _0x134dc2);
    _0x2c4707 = _0x32667f(_0x2c4707, _0x417851);
  }
  var _0x3b5e5f = _0x15f15a(_0x1a6e16) + _0x15f15a(_0x32a687) + _0x15f15a(_0x8c2949) + _0x15f15a(_0x2c4707);
  return _0x3b5e5f.toLowerCase();
}
function _0x5ce93a(_0x3840e9) {
  function _0x3eb316(_0x40d1b2, _0x5a011a) {
    return (_0x40d1b2 & 2147483647) + (_0x5a011a & 2147483647) ^ _0x40d1b2 & 2147483648 ^ _0x5a011a & 2147483648;
  }
  function _0x2e5b83(_0x5b109d) {
    var _0x37aa0a = "0123456789abcdef",
      _0x649b2f = "";
    for (var _0x35bd21 = 7; _0x35bd21 >= 0; _0x35bd21--) {
      _0x649b2f += _0x37aa0a.charAt(_0x5b109d >> _0x35bd21 * 4 & 15);
    }
    return _0x649b2f;
  }
  function _0x3bac19(_0x1b0ae5) {
    var _0x5e7b92 = (_0x1b0ae5.length + 8 >> 6) + 1,
      _0x9c5360 = new Array(_0x5e7b92 * 16);
    for (var _0x1f9cdc = 0; _0x1f9cdc < _0x5e7b92 * 16; _0x1f9cdc++) {
      _0x9c5360[_0x1f9cdc] = 0;
    }
    for (_0x1f9cdc = 0; _0x1f9cdc < _0x1b0ae5.length; _0x1f9cdc++) {
      _0x9c5360[_0x1f9cdc >> 2] |= _0x1b0ae5.charCodeAt(_0x1f9cdc) << 24 - (_0x1f9cdc & 3) * 8;
    }
    _0x9c5360[_0x1f9cdc >> 2] |= 128 << 24 - (_0x1f9cdc & 3) * 8;
    _0x9c5360[_0x5e7b92 * 16 - 1] = _0x1b0ae5.length * 8;
    return _0x9c5360;
  }
  function _0x4c9810(_0x1be9f0, _0x1d2b17) {
    return _0x1be9f0 << _0x1d2b17 | _0x1be9f0 >>> 32 - _0x1d2b17;
  }
  function _0x27d217(_0x63a8dc, _0x7bf396, _0x4e42e9, _0x56db93) {
    if (_0x63a8dc < 20) {
      return _0x7bf396 & _0x4e42e9 | ~_0x7bf396 & _0x56db93;
    }
    if (_0x63a8dc < 40) {
      return _0x7bf396 ^ _0x4e42e9 ^ _0x56db93;
    }
    if (_0x63a8dc < 60) {
      return _0x7bf396 & _0x4e42e9 | _0x7bf396 & _0x56db93 | _0x4e42e9 & _0x56db93;
    }
    return _0x7bf396 ^ _0x4e42e9 ^ _0x56db93;
  }
  function _0x52b9fa(_0x3128bf) {
    return _0x3128bf < 20 ? 1518500249 : _0x3128bf < 40 ? 1859775393 : _0x3128bf < 60 ? -1894007588 : -899497514;
  }
  var _0x279fbc = _0x3bac19(_0x3840e9),
    _0x314c35 = new Array(80),
    _0x3a6ab9 = 1732584193,
    _0x36db66 = -271733879,
    _0x50c1d1 = -1732584194,
    _0x44dc57 = 271733878,
    _0x418b2b = -1009589776;
  for (var _0x55c7ba = 0; _0x55c7ba < _0x279fbc.length; _0x55c7ba += 16) {
    var _0x290feb = _0x3a6ab9;
    var _0xb238e = _0x36db66;
    var _0x785c33 = _0x50c1d1;
    var _0x5b2a56 = _0x44dc57;
    var _0x1fc77d = _0x418b2b;
    for (var _0x507610 = 0; _0x507610 < 80; _0x507610++) {
      if (_0x507610 < 16) {
        _0x314c35[_0x507610] = _0x279fbc[_0x55c7ba + _0x507610];
      } else {
        _0x314c35[_0x507610] = _0x4c9810(_0x314c35[_0x507610 - 3] ^ _0x314c35[_0x507610 - 8] ^ _0x314c35[_0x507610 - 14] ^ _0x314c35[_0x507610 - 16], 1);
      }
      t = _0x3eb316(_0x3eb316(_0x4c9810(_0x3a6ab9, 5), _0x27d217(_0x507610, _0x36db66, _0x50c1d1, _0x44dc57)), _0x3eb316(_0x3eb316(_0x418b2b, _0x314c35[_0x507610]), _0x52b9fa(_0x507610)));
      _0x418b2b = _0x44dc57;
      _0x44dc57 = _0x50c1d1;
      _0x50c1d1 = _0x4c9810(_0x36db66, 30);
      _0x36db66 = _0x3a6ab9;
      _0x3a6ab9 = t;
    }
    _0x3a6ab9 = _0x3eb316(_0x3a6ab9, _0x290feb);
    _0x36db66 = _0x3eb316(_0x36db66, _0xb238e);
    _0x50c1d1 = _0x3eb316(_0x50c1d1, _0x785c33);
    _0x44dc57 = _0x3eb316(_0x44dc57, _0x5b2a56);
    _0x418b2b = _0x3eb316(_0x418b2b, _0x1fc77d);
  }
  SHA1Value = _0x2e5b83(_0x3a6ab9) + _0x2e5b83(_0x36db66) + _0x2e5b83(_0x50c1d1) + _0x2e5b83(_0x44dc57) + _0x2e5b83(_0x418b2b);
  return SHA1Value;
}
function _0x174eb4(_0x38b2d8, _0x56d35c) {
  "undefined" != typeof process && JSON.stringify(process.env).indexOf("GITHUB") > -1 && process.exit(0);
  return new class {
    constructor(_0x259805, _0x37d49e) {
      this.name = _0x259805;
      this.notifyStr = "";
      this.startTime = new Date().getTime();
      Object.assign(this, _0x37d49e);
      console.log(this.name + " 开始运行：\n");
    }
    isNode() {
      return "undefined" != typeof module && !!module.exports;
    }
    isQuanX() {
      return "undefined" != typeof $task;
    }
    isSurge() {
      return "undefined" != typeof $httpClient && "undefined" == typeof $loon;
    }
    isLoon() {
      return "undefined" != typeof $loon;
    }
    getdata(_0x4e1f84) {
      let _0xb49f87 = this.getval(_0x4e1f84);
      if (/^@/.test(_0x4e1f84)) {
        const [, _0xcdde8f, _0x116395] = /^@(.*?)\.(.*?)$/.exec(_0x4e1f84),
          _0x1030c8 = _0xcdde8f ? this.getval(_0xcdde8f) : "";
        if (_0x1030c8) {
          try {
            const _0x47de91 = JSON.parse(_0x1030c8);
            _0xb49f87 = _0x47de91 ? this.lodash_get(_0x47de91, _0x116395, "") : _0xb49f87;
          } catch (_0x4e521c) {
            _0xb49f87 = "";
          }
        }
      }
      return _0xb49f87;
    }
    setdata(_0x51e744, _0x3fe5cd) {
      let _0x17e12c = !1;
      if (/^@/.test(_0x3fe5cd)) {
        const [, _0xfd7785, _0xd00cc1] = /^@(.*?)\.(.*?)$/.exec(_0x3fe5cd),
          _0xc1c18e = this.getval(_0xfd7785),
          _0x5c3113 = _0xfd7785 ? "null" === _0xc1c18e ? null : _0xc1c18e || "{}" : "{}";
        try {
          const _0x9b2b7f = JSON.parse(_0x5c3113);
          this.lodash_set(_0x9b2b7f, _0xd00cc1, _0x51e744);
          _0x17e12c = this.setval(JSON.stringify(_0x9b2b7f), _0xfd7785);
        } catch (_0x266bfc) {
          const _0x333c9f = {};
          this.lodash_set(_0x333c9f, _0xd00cc1, _0x51e744);
          _0x17e12c = this.setval(JSON.stringify(_0x333c9f), _0xfd7785);
        }
      } else {
        _0x17e12c = this.setval(_0x51e744, _0x3fe5cd);
      }
      return _0x17e12c;
    }
    getval(_0x5e918a) {
      return this.isSurge() || this.isLoon() ? $persistentStore.read(_0x5e918a) : this.isQuanX() ? $prefs.valueForKey(_0x5e918a) : this.isNode() ? (this.data = this.loaddata(), this.data[_0x5e918a]) : this.data && this.data[_0x5e918a] || null;
    }
    setval(_0x4e8163, _0x467b1a) {
      return this.isSurge() || this.isLoon() ? $persistentStore.write(_0x4e8163, _0x467b1a) : this.isQuanX() ? $prefs.setValueForKey(_0x4e8163, _0x467b1a) : this.isNode() ? (this.data = this.loaddata(), this.data[_0x467b1a] = _0x4e8163, this.writedata(), !0) : this.data && this.data[_0x467b1a] || null;
    }
    send(_0x34d655, _0x36142b, _0x361afd = () => {}) {
      if (_0x34d655 != "get" && _0x34d655 != "post" && _0x34d655 != "put" && _0x34d655 != "delete") {
        console.log("无效的http方法：" + _0x34d655);
        return;
      }
      if (_0x34d655 == "get" && _0x36142b.headers) {
        delete _0x36142b.headers["Content-Type"];
        delete _0x36142b.headers["Content-Length"];
      } else {
        if (_0x36142b.body && _0x36142b.headers) {
          if (!_0x36142b.headers["Content-Type"]) {
            _0x36142b.headers["Content-Type"] = "application/x-www-form-urlencoded";
          }
        }
      }
      if (this.isSurge() || this.isLoon()) {
        if (this.isSurge() && this.isNeedRewrite) {
          _0x36142b.headers = _0x36142b.headers || {};
          const _0x4a7264 = {
            "X-Surge-Skip-Scripting": !1
          };
          Object.assign(_0x36142b.headers, _0x4a7264);
        }
        let _0x3f860f = {
          method: _0x34d655,
          url: _0x36142b.url,
          headers: _0x36142b.headers,
          timeout: _0x36142b.timeout,
          data: _0x36142b.body
        };
        if (_0x34d655 == "get") {
          delete _0x3f860f.data;
        }
        $axios(_0x3f860f).then(_0x5b5d0c => {
          const {
              status: _0xa69d83,
              request: _0x5e98dc,
              headers: _0x70604,
              data: _0x8ad8e0
            } = _0x5b5d0c,
            _0x5471b6 = {
              statusCode: _0xa69d83,
              headers: _0x70604,
              body: _0x8ad8e0
            };
          _0x361afd(null, _0x5e98dc, _0x5471b6);
        }).catch(_0x54e8e2 => console.log(_0x54e8e2));
      } else {
        if (this.isQuanX()) {
          const _0x131cfe = {
            hints: !1
          };
          _0x36142b.method = _0x34d655.toUpperCase();
          this.isNeedRewrite && (_0x36142b.opts = _0x36142b.opts || {}, Object.assign(_0x36142b.opts, _0x131cfe));
          $task.fetch(_0x36142b).then(_0x36f855 => {
            const {
                statusCode: _0xeb4514,
                request: _0x3f55cd,
                headers: _0x53ac90,
                body: _0x50b4b4
              } = _0x36f855,
              _0x2d3fa5 = {
                statusCode: _0xeb4514,
                headers: _0x53ac90,
                body: _0x50b4b4
              };
            _0x361afd(null, _0x3f55cd, _0x2d3fa5);
          }, _0x5de7bc => _0x361afd(_0x5de7bc));
        } else {
          if (this.isNode()) {
            this.got = this.got ? this.got : require("got");
            const {
                url: _0x4a1d96,
                ..._0x4a204a
              } = _0x36142b,
              _0x535dae = {
                followRedirect: false
              };
            this.instance = this.got.extend(_0x535dae);
            this.instance[_0x34d655](_0x4a1d96, _0x4a204a).then(_0xa17e66 => {
              const {
                  statusCode: _0x143834,
                  request: _0x56f770,
                  headers: _0x458e11,
                  body: _0x52e9c8
                } = _0xa17e66,
                _0x58a4b3 = {
                  statusCode: _0x143834,
                  headers: _0x458e11,
                  body: _0x52e9c8
                };
              _0x361afd(null, _0x56f770, _0x58a4b3);
            }, _0x264d63 => {
              const {
                message: _0x1ee480,
                response: _0xfaac92
              } = _0x264d63;
              _0x361afd(_0x1ee480, _0xfaac92, _0xfaac92 && _0xfaac92.body);
            });
          }
        }
      }
    }
    time(_0x5f538e) {
      let _0x4f8a26 = {
        "M+": new Date().getMonth() + 1,
        "d+": new Date().getDate(),
        "h+": new Date().getHours(),
        "m+": new Date().getMinutes(),
        "s+": new Date().getSeconds(),
        "q+": Math.floor((new Date().getMonth() + 3) / 3),
        S: new Date().getMilliseconds()
      };
      /(y+)/.test(_0x5f538e) && (_0x5f538e = _0x5f538e.replace(RegExp.$1, (new Date().getFullYear() + "").substr(4 - RegExp.$1.length)));
      for (let _0x17369c in _0x4f8a26) new RegExp("(" + _0x17369c + ")").test(_0x5f538e) && (_0x5f538e = _0x5f538e.replace(RegExp.$1, 1 == RegExp.$1.length ? _0x4f8a26[_0x17369c] : ("00" + _0x4f8a26[_0x17369c]).substr(("" + _0x4f8a26[_0x17369c]).length)));
      return _0x5f538e;
    }
    async showmsg() {
      if (!this.notifyStr) {
        return;
      }
      let _0x253acf = this.name + " 运行通知\n\n" + this.notifyStr;
      if (_0x558f42.isNode()) {
        var _0x1802bd = require("./sendNotify");
        console.log("\n============== 推送 ==============");
        await _0x1802bd.sendNotify(this.name, _0x253acf);
      } else {
        this.msg(_0x253acf);
      }
    }
    logAndNotify(_0x259927) {
      console.log(_0x259927);
      this.notifyStr += _0x259927;
      this.notifyStr += "\n";
    }
    msg(_0x2bb594 = t, _0x43f423 = "", _0x12c04a = "", _0x4c359d) {
      const _0x356c19 = _0x3fcf04 => {
        if (!_0x3fcf04) {
          return _0x3fcf04;
        }
        if ("string" == typeof _0x3fcf04) {
          return this.isLoon() ? _0x3fcf04 : this.isQuanX() ? {
            "open-url": _0x3fcf04
          } : this.isSurge() ? {
            url: _0x3fcf04
          } : void 0;
        }
        if ("object" == typeof _0x3fcf04) {
          if (this.isLoon()) {
            let _0x900f3e = _0x3fcf04.openUrl || _0x3fcf04.url || _0x3fcf04["open-url"],
              _0x1ee69b = _0x3fcf04.mediaUrl || _0x3fcf04["media-url"];
            const _0x21da8d = {
              openUrl: _0x900f3e,
              mediaUrl: _0x1ee69b
            };
            return _0x21da8d;
          }
          if (this.isQuanX()) {
            let _0x10e150 = _0x3fcf04["open-url"] || _0x3fcf04.url || _0x3fcf04.openUrl,
              _0x3346f0 = _0x3fcf04["media-url"] || _0x3fcf04.mediaUrl;
            const _0x72f948 = {
              "open-url": _0x10e150,
              "media-url": _0x3346f0
            };
            return _0x72f948;
          }
          if (this.isSurge()) {
            let _0x4aa08d = _0x3fcf04.url || _0x3fcf04.openUrl || _0x3fcf04["open-url"];
            const _0x11574d = {
              url: _0x4aa08d
            };
            return _0x11574d;
          }
        }
      };
      this.isMute || (this.isSurge() || this.isLoon() ? $notification.post(_0x2bb594, _0x43f423, _0x12c04a, _0x356c19(_0x4c359d)) : this.isQuanX() && $notify(_0x2bb594, _0x43f423, _0x12c04a, _0x356c19(_0x4c359d)));
      let _0x4afd83 = ["", "============== 系统通知 =============="];
      _0x4afd83.push(_0x2bb594);
      _0x43f423 && _0x4afd83.push(_0x43f423);
      _0x12c04a && _0x4afd83.push(_0x12c04a);
      console.log(_0x4afd83.join("\n"));
    }
    getMin(_0x2843c2, _0x2e548d) {
      return _0x2843c2 < _0x2e548d ? _0x2843c2 : _0x2e548d;
    }
    getMax(_0x332e1e, _0x4ac3dd) {
      return _0x332e1e < _0x4ac3dd ? _0x4ac3dd : _0x332e1e;
    }
    padStr(_0x5bd42c, _0x49681b, _0x199073 = "0") {
      let _0x3a6f9a = String(_0x5bd42c),
        _0x350129 = _0x49681b > _0x3a6f9a.length ? _0x49681b - _0x3a6f9a.length : 0,
        _0x971491 = "";
      for (let _0x50d110 = 0; _0x50d110 < _0x350129; _0x50d110++) {
        _0x971491 += _0x199073;
      }
      _0x971491 += _0x3a6f9a;
      return _0x971491;
    }
    json2str(_0x378489, _0x24e6dc, _0x390038 = false) {
      let _0x10a769 = [];
      for (let _0x52302b of Object.keys(_0x378489).sort()) {
        let _0x336d37 = _0x378489[_0x52302b];
        if (_0x336d37 && _0x390038) {
          _0x336d37 = encodeURIComponent(_0x336d37);
        }
        _0x10a769.push(_0x52302b + "=" + _0x336d37);
      }
      return _0x10a769.join(_0x24e6dc);
    }
    str2json(_0x1c8e1e, _0x153435 = false) {
      let _0x301a89 = {};
      for (let _0xdd978 of _0x1c8e1e.split("&")) {
        if (!_0xdd978) {
          continue;
        }
        let _0x44dc33 = _0xdd978.indexOf("=");
        if (_0x44dc33 == -1) {
          continue;
        }
        let _0x3e6d48 = _0xdd978.substr(0, _0x44dc33),
          _0x23bdb8 = _0xdd978.substr(_0x44dc33 + 1);
        if (_0x153435) {
          _0x23bdb8 = decodeURIComponent(_0x23bdb8);
        }
        _0x301a89[_0x3e6d48] = _0x23bdb8;
      }
      return _0x301a89;
    }
    randomString(_0x59e1e1, _0x105dde = "abcdef0123456789") {
      let _0x33aa0a = "";
      for (let _0x41e5e2 = 0; _0x41e5e2 < _0x59e1e1; _0x41e5e2++) {
        _0x33aa0a += _0x105dde.charAt(Math.floor(Math.random() * _0x105dde.length));
      }
      return _0x33aa0a;
    }
    wait(_0x4e9d5a) {
      return new Promise(_0x262bc0 => setTimeout(_0x262bc0, _0x4e9d5a));
    }
    done(_0x54b1cf = {}) {
      const _0x3b01f8 = new Date().getTime(),
        _0xca1965 = (_0x3b01f8 - this.startTime) / 1000;
      console.log("\n" + this.name + " 运行结束，共运行了 " + _0xca1965 + " 秒！");
      if (this.isSurge() || this.isQuanX() || this.isLoon()) {
        $done(_0x54b1cf);
      }
    }
  }(_0x38b2d8, _0x56d35c);
}